{
  "metadata": {
    "title": "MeeMaw's Recipe Collection",
    "compiler": "Wilfred Carle",
    "date_compiled": "April 8, 1995",
    "family": "Alma Finken Carle",
    "note": "Recipes restored to original ingredients (butter, eggs, whole milk) and categories consolidated.",
    "version": "4.0 - Heirloom Edition"
  },
  "categories": [
    {
      "name": "Appetizers, Dips & Snacks",
      "recipes": [
        {
          "name": "Marinated Peppers",
          "category": "Appetizers, Dips & Snacks",
          "servings": "4–6 as appetizer",
          "ingredients": [
            "4 Red bell peppers",
            "1 tablespoon Olive oil",
            "4 tablespoons Red wine vinegar",
            "3/4 teaspoon Sugar",
            "1/2 teaspoon Dried basil",
            "2 tablespoons (optional) Capers (drained)",
            "to taste Freshly ground black pepper"
          ],
          "instructions": [
            "Preheat the oven to 350–375°F (175–190°C). Line a baking sheet with foil for easier cleanup.",
            "Place the whole red peppers on the baking sheet. Roast for 30–40 minutes, turning occasionally, until the skins are blistered and the peppers are very soft.",
            "While the peppers roast, whisk together the olive oil, red wine vinegar, sugar, dried basil, and a few grinds of black pepper in a small bowl. If using capers, you can stir them into the marinade now.",
            "When the peppers are done, transfer them to a bowl and cover tightly (or place them in a paper bag) for 10–15 minutes to steam. This loosens the skins.",
            "Peel off the skins, remove stems and seeds, and cut the pepper flesh into strips.",
            "Combine the warm pepper strips with the marinade (and capers, if using). Toss gently until everything is well coated.",
            "Let the peppers cool to room temperature, then cover and refrigerate for at least 2 hours or overnight for best flavor.",
            "Serve at cool room temperature as an appetizer, side dish, or part of an antipasto platter."
          ]
        },
        {
          "name": "Mushroom and Nut Pate",
          "category": "Appetizers, Dips & Snacks",
          "servings": "Makes about 1 cup",
          "ingredients": [
            "2 tablespoons Butter",
            "1 pound, sliced Fresh mushrooms",
            "1 small, chopped Onion",
            "1 clove, minced Garlic",
            "1 cup Slivered almonds",
            "2 tablespoons Vegetable oil",
            "1/4 teaspoon Dried oregano",
            "1/4 teaspoon Dried thyme",
            "dash, or to taste Tabasco or hot sauce"
          ],
          "instructions": [
            "Melt the unsalted butter in a large skillet over medium heat.",
            "Add the sliced mushrooms, chopped onion, and minced garlic. Cook, stirring occasionally, for 8–10 minutes, until the mushrooms release their liquid and it has evaporated, and the vegetables are soft and lightly browned. Let cool slightly.",
            "In a food processor or blender, coarsely chop the slivered almonds. Remove 2–3 tablespoons and reserve for garnish, if desired.",
            "With the processor running, slowly drizzle in the vegetable oil and process until the almonds form a thick, spreadable paste.",
            "Add the cooked mushroom mixture, dried oregano, dried thyme, and a dash of hot sauce to the processor. Blend until the mixture is fairly smooth but still has a little texture, scraping down the sides as needed.",
            "Taste and adjust seasoning with additional hot sauce and a pinch of salt, if desired.",
            "Transfer the pâté to a small bowl or crock. Smooth the top and sprinkle with the reserved chopped almonds and a little chopped parsley or sesame seeds, if you like.",
            "Cover and chill for at least 2 hours to allow the flavors to blend. Serve cold or cool with crackers, sliced baguette, or raw vegetables."
          ]
        },
        {
          "name": "The Little English Muffin Pizza",
          "category": "Appetizers, Dips & Snacks",
          "servings": "4 pieces",
          "ingredients": [
            "4 halves English muffins (2 whole muffins, split)",
            "about 1–2 tablespoons per muffin half Pizza sauce",
            "about 2–3 tablespoons per muffin half Mozzarella cheese, grated",
            "about 1 tablespoon per muffin half Bacon bits"
          ],
          "instructions": [
            "Preheat the oven or toaster oven to 400°F (200°C).",
            "Arrange the English muffin halves, cut side up, on a baking sheet.",
            "Spread each muffin half with 1–2 tablespoons of pizza sauce.",
            "Top each with 2–3 tablespoons of grated mozzarella cheese and sprinkle with bacon bits.",
            "Bake for about 8–10 minutes, or until the cheese is melted and bubbly and the muffin edges are lightly crisp.",
            "Serve hot. Makes 4 small pizzas."
          ]
        },
        {
          "name": "Roasted Nuts",
          "category": "Appetizers, Dips & Snacks",
          "servings": "About 8–10 snack servings",
          "ingredients": [
            "4 cups Mixed nuts (unsalted, any combination of pecans, walnuts, almonds, cashews, etc.)",
            "1/2 stick (1/4 cup) Butter (melted)",
            "1/2–3/4 teaspoon Salt (optional, or to taste)"
          ],
          "instructions": [
            "Preheat the oven to 250°F (120°C). Line a rimmed baking sheet with parchment paper for easier cleanup.",
            "Place the nuts in a large bowl. Drizzle with the melted unsalted butter or butter and sprinkle with salt if using.",
            "Toss until all the nuts are evenly coated.",
            "Spread the nuts in a single layer on the prepared baking sheet.",
            "Bake for 30–40 minutes, stirring every 10 minutes, until the nuts are fragrant and lightly toasted. Watch carefully so they do not burn.",
            "Remove from the oven and let cool completely on the pan; they will crisp as they cool.",
            "Store in an airtight container at room temperature for up to 1–2 weeks."
          ]
        },
        {
          "name": "Cheese Dip (Like Mexico Chiquito's)",
          "category": "Appetizers, Dips & Snacks",
          "servings": "About 2 1/2 cups",
          "ingredients": [
            "1/2 stick (4 tablespoons) Butter",
            "1/4 cup All-purpose flour",
            "1 teaspoon Paprika",
            "1/4 teaspoon Dry mustard",
            "1 teaspoon Ground cumin",
            "1 teaspoon Ketchup",
            "1 1/2 teaspoons Chili powder",
            "1 teaspoon Pickled jalapeno juice",
            "2 cups Milk (whole or 2%)",
            "1/2 pepper Pickled jalapeno pepper (minced, or to taste)",
            "1/4 teaspoon Garlic powder",
            "6 ounces (about 1 1/2 cups shredded) American cheese"
          ],
          "instructions": [
            "Melt the unsalted butter in a medium saucepan over medium-low heat.",
            "Stir in the flour and cook, stirring constantly, for 1–2 minutes to make a roux (do not let it brown).",
            "Add the paprika, dry mustard, cumin, ketchup, chili powder, and jalapeno juice. Stir well.",
            "Gradually pour in the milk, whisking constantly to avoid lumps. Increase heat slightly and cook, stirring, until the mixture thickens and comes to a gentle simmer.",
            "Reduce heat to low. Stir in the minced jalapeno, garlic powder, and grated cheese. Continue stirring until the cheese melts and the dip is smooth.",
            "Taste and adjust seasoning, adding more jalapeno or chili powder for extra heat if desired.",
            "Serve warm with tortilla chips, vegetables, or as a topping for nachos."
          ]
        },
        {
          "name": "Chocolate Fondue",
          "category": "Appetizers, Dips & Snacks",
          "servings": "About 1 1/2 cups (4-6 servings)",
          "ingredients": [
            "1/2 cup (1 stick) Butter",
            "1/2 cup Cocoa powder (unsweetened, preferably Ghirardelli)",
            "3/4 cup White sugar",
            "5 ounces (about 2/3 cup) Evaporated milk",
            "1 teaspoon Vanilla extract",
            "as desired Assorted dippers (such as pound cake cubes, cookies, marshmallows, fresh strawberries, pineapple chunks, mandarin orange segments, cherries)"
          ],
          "instructions": [
            "Melt the butter in a medium saucepan over low heat.",
            "Remove the pan from the heat and whisk in the cocoa powder until smooth.",
            "Stir in the sugar and evaporated milk, mixing until well combined.",
            "Return the pan to low heat. Cook, stirring constantly, until the mixture is smooth, hot, and slightly thickened. Do not let it boil.",
            "Remove from heat and stir in the vanilla extract.",
            "Transfer the fondue to a fondue pot or small slow cooker to keep warm, or serve immediately in a bowl.",
            "Arrange your choice of dippers on a platter and enjoy!"
          ]
        },
        {
          "name": "Crab Dip",
          "category": "Appetizers, Dips & Snacks",
          "servings": "About 3 cups",
          "ingredients": [
            "1/2 cup plain Greek yogurt or sour cream",
            "2 tablespoons mayonnaise",
            "8 ounces cream cheese (softened)",
            "1-2 teaspoons Prepared horseradish (to taste)",
            "1/2 teaspoon Dry mustard",
            "1/2 teaspoon Worcestershire sauce",
            "1/4 teaspoon Hot pepper sauce (or to taste)",
            "1 cup shredded cheddar cheese",
            "1/2 pound (about 2 cups) Imitation crab meat (flaked)",
            "for garnish Paprika"
          ],
          "instructions": [
            "In a medium bowl, combine the yogurt, mayonnaise, and softened cream cheese. Stir or beat until smooth.",
            "Add the horseradish, dry mustard, Worcestershire sauce, and hot pepper sauce. Mix well.",
            "Fold in the shredded cheddar cheese and flaked crab meat until evenly distributed.",
            "Cover and refrigerate for at least 2 hours to let the flavors blend.",
            "Before serving, sprinkle the top with paprika for color.",
            "Serve chilled with crackers, toasted baguette slices, breadsticks, or fresh vegetables."
          ]
        }
      ]
    },
    {
      "name": "Icings & Sauces",
      "recipes": [
        {
          "name": "Confectioner's Glaze",
          "category": "Icings, Glazes & Sauces",
          "servings": "About 2 cups (enough for cookies, cakes, or sweet rolls)",
          "ingredients": [
            "1 pound (about 3 3/4 cups) Powdered sugar (sifted if lumpy)",
            "2-4 tablespoons Hot water (start with 2, add more as needed)",
            "2 teaspoons Extract (vanilla, rum, maple, lemon, or any flavor)"
          ],
          "instructions": [
            "In a medium bowl, sift the powdered sugar if it is at all lumpy.",
            "In a small bowl or cup, combine 2 tablespoons hot water with the extract of your choice.",
            "Add the liquid to the powdered sugar and stir with a spoon until smooth.",
            "Add more hot water, 1 teaspoon at a time, stirring well after each addition, until the glaze reaches your desired consistency. For a thin drizzle, make it thinner; for spreading, keep it thicker.",
            "Use immediately to glaze cookies, cakes, or sweet rolls. The glaze will set as it cools."
          ]
        },
        {
          "name": "Fluffy Cocoa Frosting",
          "category": "Icings, Glazes & Sauces",
          "servings": "Enough to frost a 2-layer 9-inch or 10-inch cake",
          "ingredients": [
            "3/4 cup Cocoa powder (unsweetened)",
            "4 cups Powdered sugar (sifted)",
            "1/3 cup Vegetable oil",
            "1 teaspoon Vanilla extract",
            "1/2 cup Buttermilk or evaporated whole milk (more if needed)"
          ],
          "instructions": [
            "Sift together the cocoa powder and powdered sugar into a mixing bowl.",
            "Add the vegetable oil, vanilla extract, and 1/2 cup of buttermilk or evaporated milk.",
            "Beat with an electric mixer at medium speed until smooth and fluffy, about 2 minutes.",
            "If the frosting is too thick, add additional buttermilk, 1 tablespoon at a time, until it reaches a good spreading consistency.",
            "Use immediately to frost cooled cakes or cupcakes. The frosting will set slightly as it stands."
          ]
        },
        {
          "name": "Fluffy White Frosting",
          "category": "Icings, Glazes & Sauces",
          "servings": "Enough to frost a 2-layer 9-inch cake",
          "ingredients": [
            "2 large Egg whites (at room temperature)",
            "3/4 cup Granulated sugar",
            "1/3 cup Light corn syrup",
            "2 tablespoons Water",
            "1/4 teaspoon Cream of tartar",
            "1/4 teaspoon Salt",
            "1 teaspoon Vanilla extract"
          ],
          "instructions": [
            "Fill the bottom of a double boiler with water and bring to a rapid boil over high heat.",
            "In the top of the double boiler (off heat), combine the egg whites, sugar, corn syrup, water, cream of tartar, and salt.",
            "Place the top pan over the boiling water and immediately begin beating with a handheld electric mixer at high speed.",
            "Continue beating constantly for about 7 minutes, or until the frosting forms stiff, glossy peaks.",
            "Remove from heat, add the vanilla extract, and beat for another minute until the vanilla is fully incorporated and the frosting is very fluffy.",
            "Use immediately to frost a cooled cake, spreading with a spatula to create swirls and peaks. The frosting will set as it cools."
          ]
        },
        {
          "name": "Orange-Cream Cheese Frosting",
          "category": "Icings, Glazes & Sauces",
          "servings": "About 1 1/2 cups (enough for a 9x13-inch cake)",
          "ingredients": [
            "1/2 cup cottage cheese (1% or 2% fat)",
            "8 oz Light cream cheese (softened to room temperature)",
            "2 teaspoons Vanilla extract",
            "1 teaspoon, finely grated Fresh orange zest (from about 1/2 orange)",
            "1 cup, sifted Powdered sugar"
          ],
          "instructions": [
            "Place the cottage cheese in a food processor fitted with the metal blade. Process for about 1 minute, or until completely smooth with no lumps.",
            "Add the softened cream cheese, vanilla extract, and orange zest. Process until well combined and very smooth, about 30 seconds.",
            "Add the sifted powdered sugar. Pulse 3-5 times, then process briefly until the frosting is smooth and creamy.",
            "Taste and adjust sweetness if desired by adding a bit more powdered sugar.",
            "Use immediately to frost a cooled carrot cake, spice cake, or other baked goods. Store any leftover frosting covered in the refrigerator."
          ]
        },
        {
          "name": "Cocktail Sauce",
          "category": "Icings, Glazes & Sauces",
          "servings": "About 1 1/2 cups",
          "ingredients": [
            "1 cup Catsup",
            "1/2 cup Chili sauce",
            "1 tablespoon Worcestershire sauce",
            "1-2 tablespoons Prepared horseradish (to taste)",
            "1/2 teaspoon Hot sauce (such as Tabasco)",
            "1/4 teaspoon Celery salt",
            "1 1/2 tablespoons Fresh lemon juice (optional, but recommended)"
          ],
          "instructions": [
            "In a medium bowl, combine the catsup, chili sauce, Worcestershire sauce, horseradish, hot sauce, and celery salt.",
            "Stir well until fully mixed.",
            "Add the lemon juice if using, and stir again.",
            "Taste and adjust the horseradish and hot sauce to your preferred level of heat.",
            "Cover and refrigerate for at least 30 minutes to allow the flavors to blend.",
            "Serve chilled with boiled shrimp, crab, or oysters. Store covered in the refrigerator for up to 1 week."
          ]
        },
        {
          "name": "Tomato Sauce",
          "category": "Icings, Glazes & Sauces",
          "servings": "About 4 cups (enough for pasta or stuffed shells)",
          "ingredients": [
            "2 tablespoons Olive oil or vegetable oil",
            "1/2 cup, chopped Onion",
            "1 clove, minced Garlic",
            "3 cups Tomato juice",
            "1 can (6 oz) Tomato paste",
            "2 tablespoons Chili sauce",
            "1 teaspoon Salt",
            "1/2 teaspoon Sugar",
            "1/4 teaspoon Black pepper",
            "1/2 teaspoon Dried basil or Italian seasoning (optional)"
          ],
          "instructions": [
            "Heat the oil in a medium saucepan over medium heat.",
            "Add the chopped onion and cook, stirring frequently, until softened and translucent, about 5 minutes.",
            "Add the minced garlic and cook for 1 minute more, stirring constantly so it doesn't burn.",
            "Stir in the tomato juice, tomato paste, chili sauce, salt, sugar, and pepper. Add dried basil or Italian seasoning if using.",
            "Bring the sauce to a simmer, then reduce heat to low.",
            "Simmer uncovered for 10-15 minutes, stirring occasionally, until the sauce has thickened slightly and the flavors have blended.",
            "Taste and adjust seasoning as needed. Use as a sauce for pasta, stuffed shells, lasagna, or pizza."
          ]
        },
        {
          "name": "Bechamel Sauce Topping",
          "category": "Icings, Glazes & Sauces",
          "servings": "About 2 cups",
          "ingredients": [
            "2 tablespoons Butter",
            "2 tablespoons All-purpose flour",
            "2 cups Milk (whole or 2%, warmed)",
            "1/2 teaspoon Salt (or to taste)",
            "1/4 teaspoon White pepper (freshly ground, or to taste)",
            "pinch Ground nutmeg (optional, for classic French flavor)"
          ],
          "instructions": [
            "In a medium saucepan, melt the unsalted butter or butter over medium heat.",
            "Add the flour and whisk constantly for 2-3 minutes to cook the flour and form a smooth roux. The mixture should be bubbly but not browned.",
            "Gradually pour in the warm milk, whisking constantly to prevent lumps from forming.",
            "Bring the sauce to a gentle simmer, whisking frequently. Cook for 5-7 minutes, or until the sauce thickens to a creamy consistency that coats the back of a spoon.",
            "Season with salt, white pepper, and a pinch of nutmeg if desired. Taste and adjust seasoning.",
            "Use immediately as a topping for steamed vegetables (such as broccoli, cauliflower, or asparagus), as a base for creamy pasta dishes, in casseroles, or as a component in lasagna or gratins.",
            "If the sauce becomes too thick, thin it with a little more warm milk. If it's too thin, simmer a bit longer or whisk in a small amount of flour paste (1 tsp flour mixed with 1 tbsp water).",
            "Store leftover sauce in an airtight container in the refrigerator for up to 3 days. Reheat gently, whisking in a little milk to restore smoothness."
          ]
        }
      ]
    },
    {
      "name": "Desserts",
      "recipes": [
        {
          "name": "Meringue",
          "category": "Desserts (Misc)",
          "servings": "1 9-inch pie",
          "ingredients": [
            "3 large Egg whites",
            "1/4 teaspoon Cream of tartar",
            "6 tablespoons Sugar"
          ],
          "instructions": [
            "Preheat oven to 300°F (150°C). Prepare a fully baked pie with cooled filling.",
            "In a clean, grease-free bowl, beat egg whites on medium speed until frothy.",
            "Add cream of tartar and continue beating until soft peaks form.",
            "Gradually add sugar, 1 tablespoon at a time, beating constantly, until stiff, glossy peaks form and all sugar is dissolved.",
            "Pile the meringue lightly over the cooled filling, spreading to seal completely to the crust edge to prevent shrinking.",
            "Swirl the surface or pull up points with the back of a spoon for a decorative finish.",
            "Bake 15–20 minutes, until the meringue is set and lightly golden.",
            "Cool at room temperature, away from drafts, before serving."
          ]
        },
        {
          "name": "Blueberry Pie Filling",
          "category": "Desserts (Misc)",
          "servings": "Fills one 9-inch baked pie shell",
          "ingredients": [
            "4 cups Blueberries (fresh or frozen)",
            "1 cup Water",
            "1 cup Sugar",
            "3 tbsp (fresh berries) or 5 tbsp (frozen berries) Cornstarch",
            "Juice of 1/2 lemon Lemon juice",
            "2–3 tablespoons Cream cheese (softened, to line crust)",
            "As desired Light whipped topping (for serving)"
          ],
          "instructions": [
            "In a medium saucepan, combine 1 cup (150 g) of the blueberries with the water and sugar. Bring to a boil over medium heat and cook a few minutes until the berries begin to soften.",
            "Strain the mixture to remove the berry skins, returning the liquid to the saucepan.",
            "Whisk the cornstarch into a small amount of cool water to make a smooth slurry, then whisk into the hot blueberry liquid.",
            "Cook over medium heat, stirring constantly, until the mixture comes to a full boil and thickens and becomes glossy.",
            "Remove from the heat and stir in the lemon juice, then gently fold in the remaining blueberries.",
            "Let the filling cool until just warm.",
            "Spread a thin layer of softened cream cheese over the bottom of a cooled, baked 9-inch pie shell.",
            "Pour the blueberry filling into the shell and smooth the top. Chill until fully set.",
            "Before serving, spread or dollop light whipped topping over the pie if desired."
          ]
        },
        {
          "name": "Cherry Pie Filling (Quick)",
          "category": "Desserts (Misc)",
          "servings": "Fills one 9-inch baked pie shell",
          "ingredients": [
            "1/2 cup Sugar",
            "2 tablespoons Cornstarch",
            "1/8 teaspoon Salt",
            "1 can (16 oz), drained (reserve juice) Water-packed red sour cherries",
            "As needed Water (to bring reserved juice to 1 cup / 240 ml)",
            "A few drops Almond extract",
            "1 teaspoon Grated orange rind",
            "1 ounce cream cheese (softened, to line crust)",
            "2–4 tablespoons Light whipped topping (for topping)"
          ],
          "instructions": [
            "Drain the canned cherries and reserve the juice. Add enough water to the juice to make 1 cup (240 ml).",
            "In a medium saucepan, whisk together sugar, cornstarch, and salt.",
            "Gradually whisk in the cherry juice mixture until smooth.",
            "Cook over medium heat, stirring constantly, until the sauce thickens and comes to a full boil.",
            "Remove from the heat and stir in almond extract, grated orange rind, and the drained cherries.",
            "Let the cherry mixture cool until just warm.",
            "Spread the softened cream cheese in a thin layer over the bottom of a cooled, baked 9-inch pie shell.",
            "Pour the cherry filling into the crust and smooth the top. Chill until fully set.",
            "Before serving, spread or dollop light whipped topping over the pie."
          ]
        },
        {
          "name": "Karo Nut Pie",
          "category": "Desserts (Misc)",
          "servings": "One 9-inch pie",
          "ingredients": [
            "1/2 cup Karo syrup (light (white) or dark)",
            "1/2 cup Sugar",
            "2 teaspoons Butter (melted, optional)",
            "2 large Eggs",
            "1 teaspoon Vanilla extract",
            "1 cup Pecan pieces (coarsely chopped)",
            "1 Unbaked pie shell (9-inch, homemade or purchased)"
          ],
          "instructions": [
            "Preheat oven to 325°F (165°C). Place a baking sheet on the center rack to catch any drips.",
            "In a mixing bowl, whisk together Karo syrup, sugar, melted unsalted butter or butter, eggs, and vanilla until smooth.",
            "Stir in the pecan pieces until evenly distributed.",
            "Pour the filling into the unbaked 9-inch pie shell.",
            "Bake 35–45 minutes, until the center is just set and only slightly jiggles when gently shaken. If the crust browns too quickly, cover the edge with foil.",
            "Cool completely on a rack before slicing."
          ],
          "notes": [
            "Wilfred Carle's favorite pie to eat!"
          ]
        },
        {
          "name": "Peanut Butter Pie",
          "category": "Desserts (Misc)",
          "servings": "One 9-inch pie",
          "ingredients": [
            "1 cup Powdered sugar",
            "1/2 cup Crunchy peanut butter",
            "2/3 cup Sugar",
            "1/4 cup Cornstarch",
            "1/4 teaspoon Salt",
            "2 cups, scalded Milk (2%, 1/2%, or skim)",
            "3 Egg yolks (beaten with unsalted butter)",
            "2 tablespoons Butter",
            "1/4 teaspoon Vanilla extract",
            "3 Egg whites",
            "6 tablespoons Sugar (or use Meringue recipe in this section)",
            "1 Baked pie shell (9-inch)"
          ],
          "instructions": [
            "Prepare the crumb layer by mixing powdered sugar and crunchy peanut butter with a fork until crumbly. Reserve about 1/4 of the mixture for topping and press the remaining 3/4 evenly into the bottom of a cooled, baked 9-inch pie shell.",
            "In a heavy saucepan, whisk together sugar, cornstarch, and salt.",
            "Gradually whisk in the hot scalded milk until smooth.",
            "In a separate bowl, beat egg yolks with the softened unsalted butter.",
            "Slowly whisk a ladleful of the hot milk mixture into the egg yolk mixture to temper, then return the egg mixture to the saucepan.",
            "Cook over medium-low heat, stirring constantly, until the custard thickens and just begins to bubble. Remove from heat and stir in vanilla.",
            "Pour the hot custard into the prepared pie shell over the peanut butter crumbs.",
            "Prepare a meringue with the 3 egg whites and sugar (or use the Meringue recipe in this section). Spread the meringue over the hot filling, sealing to the crust.",
            "Sprinkle the reserved peanut butter crumb mixture over the meringue.",
            "Bake at 325–350°F (165–175°C) until the meringue is golden brown. Cool completely before serving."
          ]
        },
        {
          "name": "Pumpkin Pie",
          "category": "Desserts (Misc)",
          "servings": "One 9-inch pie",
          "ingredients": [
            "2 large Eggs",
            "1 can (16 oz) Solid pack pumpkin",
            "3/4 cup Sugar",
            "1/2 teaspoon Salt",
            "1 teaspoon Ground cinnamon",
            "1/2 teaspoon Ground ginger",
            "1/4 teaspoon Ground cloves",
            "1 1/2 cups (12 oz can), undiluted Evaporated whole milk",
            "1 Unbaked pie shell (9-inch, with high fluted edge)"
          ],
          "instructions": [
            "Preheat oven to 425°F (220°C). Place a baking sheet on the middle rack.",
            "In a large bowl, whisk eggs until blended.",
            "Add pumpkin, sugar, salt, cinnamon, ginger, and cloves. Whisk until smooth.",
            "Gradually whisk in the evaporated milk until the filling is well combined.",
            "Place the unbaked 9-inch pie shell on the hot baking sheet. Pour the filling into the shell.",
            "Bake at 425°F (220°C) for 15 minutes.",
            "Reduce oven temperature to 350°F (175°C) and continue baking 35–45 minutes, or until a knife inserted near the center comes out clean or the center registers about 190°F (88°C).",
            "Cool on a wire rack. Chill if you like a firmer texture.",
            "Top with whipped topping before serving, if desired."
          ]
        },
        {
          "name": "Strawberry Glaze Pie (French)",
          "category": "Desserts (Misc)",
          "servings": "One 9-inch pie",
          "ingredients": [
            "1 quart Fresh strawberries (washed, hulled, well drained)",
            "3 oz Cream cheese (softened, or regular)",
            "1 cup Sugar",
            "3 tablespoons Cornstarch",
            "As needed Water (to bring berry juice to 1 1/2 cups / 360 ml)",
            "As desired Light whipped topping",
            "1 Baked pie shell (9-inch)"
          ],
          "instructions": [
            "Reserve the nicest half of the strawberries to remain whole. Slice them in half if large.",
            "Mash the remaining berries and strain through a sieve to extract juice. Add enough water to make 1 1/2 cups (360 ml) of liquid.",
            "In a saucepan, whisk together sugar and cornstarch.",
            "Gradually whisk in the strawberry juice mixture until smooth.",
            "Cook over medium heat, stirring constantly, until the mixture comes to a boil and thickens and turns glossy.",
            "Remove from heat and let cool until just warm.",
            "Spread softened cream cheese in a thin layer over the bottom of a cooled, baked 9-inch pie shell.",
            "Arrange the reserved whole strawberries over the cream cheese, cut side down if halved.",
            "Pour the warm glaze evenly over the berries, coating them well.",
            "Chill for at least 2 hours, until set.",
            "Remove from the refrigerator about 20 minutes before serving to take the chill off the crust. Top with whipped topping, if desired."
          ]
        },
        {
          "name": "Baked Rice Custard",
          "category": "Desserts (Misc)",
          "servings": "4 servings",
          "ingredients": [
            "2 large, slightly beaten Eggs",
            "1/4 cup Granulated sugar",
            "1 teaspoon Vanilla extract",
            "1/4 teaspoon Salt",
            "1 1/3 cups Milk (scalded (heated until steaming with a film on top))",
            "1 cup Cooked white rice (medium-grain rice, cooked and cooled)",
            "1/4 cup Raisins",
            "1/2 teaspoon Ground cinnamon (plus extra for dusting)"
          ],
          "instructions": [
            "Preheat oven to 325°F (165°C). Lightly coat four custard cups or a 1-quart baking dish with nonstick spray.",
            "In a medium bowl, beat together the eggs, sugar, vanilla, and salt until well combined.",
            "Heat the milk in a saucepan or microwave until it is scalded (steaming hot with a film on top, but not boiling). This takes about 3-4 minutes in the microwave or 5 minutes on the stovetop.",
            "Slowly pour the hot milk into the egg mixture, whisking constantly to prevent the eggs from cooking.",
            "Stir in the cooked rice, raisins, and cinnamon until evenly distributed.",
            "Divide the mixture evenly among the four custard cups, or pour it all into a baking dish.",
            "Place the cups or dish in a larger baking pan. Carefully pour hot water into the pan to reach about 1 inch up the sides of the custard cups (this is a water bath, or bain-marie).",
            "Bake for 40-45 minutes, or until a knife inserted near the center comes out clean and the custard is just set.",
            "Carefully remove from the water bath and let cool slightly.",
            "Serve warm or chilled, dusted with a little extra cinnamon if desired."
          ]
        },
        {
          "name": "Bread Pudding",
          "category": "Desserts (Misc)",
          "servings": "8 servings",
          "ingredients": [
            "7 slices Good quality white bread (French, Italian, or artisan-style)",
            "3-4 tablespoons Soft butter (for spreading)",
            "1 quart (4 cups) or whole milk",
            "3 large, lightly beaten Eggs",
            "1/2 cup Granulated sugar",
            "1/4 teaspoon Salt",
            "1/2 cup Raisins",
            "1 teaspoon Vanilla extract",
            "1/2 teaspoon Ground cinnamon",
            "1/4 teaspoon Ground nutmeg (optional)"
          ],
          "instructions": [
            "Preheat oven to 325°F (165°C). Coat a 2-quart baking dish with nonstick spray.",
            "Spread a generous amount of unsalted butter or butter on one side of each slice of bread.",
            "Arrange the bread slices, buttered side up, in the bottom and slightly up the sides of the prepared baking dish, overlapping as needed.",
            "In a large bowl, whisk together the milk, beaten eggs, sugar, salt, raisins, vanilla, cinnamon, and nutmeg (if using) until well combined.",
            "Pour the milk mixture evenly over the bread in the baking dish.",
            "If you have extra bread slices, tear them into pieces and place them on top, pressing down gently so they are submerged in the custard.",
            "Let the pudding stand for about 10 minutes to allow the bread to soak up some of the liquid. If your bread is very dry or stale, let it stand a bit longer.",
            "Cover the dish with aluminum foil and bake for 30 minutes.",
            "Remove the foil and bake for an additional 30 minutes, or until the pudding is set in the center and the top is golden brown.",
            "For an extra-crispy top, place the pudding under a hot broiler for 2-3 minutes, watching carefully to prevent burning.",
            "Let cool for 10 minutes before serving. Serve warm, plain or with a drizzle of cream, caramel sauce, or a dusting of powdered sugar."
          ]
        },
        {
          "name": "Cranberry or Blueberry Crunch",
          "category": "Desserts (Misc)",
          "servings": "6-8 servings",
          "ingredients": [
            "1 1/2 cups, uncooked Old-fashioned rolled oats",
            "3/4 cup Granulated sugar (for the crust)",
            "1/2 cup All-purpose flour",
            "1/2 teaspoon Salt",
            "3/4 stick (6 tablespoons) Butter (cold, cut into small pieces)",
            "For Berry Sauce:",
            "1 cup Granulated sugar (for the sauce)",
            "1 cup Water",
            "1/2 lb (about 2 cups) Fresh cranberries or blueberries"
          ],
          "instructions": [
            "First, make the berry sauce: In a medium saucepan, combine 1 cup sugar and 1 cup water. Stir to dissolve the sugar, then bring to a boil over medium-high heat. Boil for 5 minutes.",
            "Add the fresh cranberries or blueberries and cook, stirring occasionally, until the berry skins pop and the mixture thickens, about 15 minutes. To test for doneness, drop a spoonful onto a cold plate—it should jell slightly.",
            "Remove from heat and let the sauce cool slightly. You can use it warm or refrigerate until ready to use.",
            "Preheat oven to 350°F (175°C). Coat a 9-inch pie pan or similar baking dish with nonstick spray.",
            "For the crumb mixture: In a medium bowl, combine the oats, 3/4 cup sugar, flour, and salt. Add the cold unsalted butter or butter and work it in with your fingers or a pastry cutter until the mixture resembles coarse crumbs.",
            "Press half of the crumb mixture gently and evenly into the bottom of the prepared baking dish to form a crust.",
            "Spread 1 1/2 cups of the prepared berry sauce over the crust, leaving a small border around the edge so the filling doesn't spread to the very edge.",
            "Sprinkle the remaining crumb mixture evenly over the top of the berry filling, patting it down gently. Press the edges to seal.",
            "Bake for 30-35 minutes, or until the topping is golden brown and the filling is bubbling around the edges.",
            "Let cool for at least 15 minutes before serving. Serve warm or at room temperature, plain or with vanilla ice cream or whipped cream."
          ]
        },
        {
          "name": "Kitchen Memorandum",
          "category": "Desserts",
          "servings": null,
          "ingredients": [],
          "instructions": [
            "BAKING TIPS:",
            "- Always preheat your oven 10-15 minutes before baking",
            "- Measure dry ingredients by spooning into measuring cups and leveling off",
            "- Measure liquids in clear measuring cups at eye level",
            "- Test baking powder/soda freshness: add to hot water; should bubble vigorously",
            "- Bring butter and eggs to room temperature for better incorporation (about 30 minutes)",
            "",
            "MIXING GUIDELINES:",
            "- Cream butter and sugar until light and fluffy (3-5 minutes)",
            "- Add eggs one at a time, beating well after each addition",
            "- Alternate adding dry and wet ingredients, beginning and ending with dry",
            "- Don't overmix once flour is added - mix just until no streaks remain",
            "",
            "PAN PREPARATION:",
            "- Grease pans with shortening, butter, or nonstick spray",
            "- For cakes, grease and flour pans, or line with parchment",
            "- For cookies, parchment paper prevents sticking and ensures even browning",
            "",
            "STORAGE:",
            "- Cool baked goods completely before storing",
            "- Store cookies in airtight containers with parchment between layers",
            "- Most cookie dough can be refrigerated 3 days or frozen 3 months",
            "- Bread stays fresh longer stored in paper bags, not plastic",
            "",
            "These tips from Alma's kitchen will help ensure success with all recipes in this collection."
          ]
        }
      ]
    },
    {
      "name": "Main Dishes",
      "recipes": [
        {
          "name": "Turkey Sausage",
          "category": "Main Dishes (Poultry)",
          "servings": "About 16–20 patties",
          "ingredients": [
            "4 pounds Ground turkey breast (very lean)",
            "1 1/2 cups Wheat germ (adds body and a nutty flavor)",
            "1/2 cup Vegetable oil",
            "1 tablespoon Dried sage",
            "1 tablespoon Crushed coriander seed",
            "1 teaspoon Coarse black pepper",
            "1/2 teaspoon White pepper",
            "1/2 teaspoon Red pepper flakes or ground red pepper (or to taste)",
            "1/2 teaspoon Ground cumin",
            "1 teaspoon Dried thyme",
            "4 large, finely minced Garlic cloves",
            "2 teaspoons Old Bay seasoning",
            "1 tablespoon Salt",
            "2–4 tablespoons, as needed Cold water"
          ],
          "instructions": [
            "In a small bowl, stir together the wheat germ and vegetable oil until evenly moistened. Cover and let stand at room temperature overnight, or at least 1 hour.",
            "In a large mixing bowl, combine the ground turkey, sage, coriander, black and white pepper, red pepper, cumin, thyme, garlic, Old Bay, and salt.",
            "Add the wheat germ mixture and mix thoroughly with clean hands until the seasonings are evenly distributed and the mixture feels cohesive but not dry. If it seems crumbly, sprinkle in 2–4 tablespoons (30–60 ml) cold water and mix again.",
            "For best flavor, cover and refrigerate the sausage mixture for at least 4 hours or overnight.",
            "Shape into patties or logs for links, using about 1/4 cup (60 g) of mixture per patty.",
            "To cook, brown sausage over medium heat in a lightly oiled skillet, 4–5 minutes per side, until cooked through (internal temperature 165°F / 74°C). Alternatively, shape into logs and bake on a parchment-lined tray at 375°F (190°C) for 18–22 minutes, turning once.",
            "Serve hot with eggs and potatoes, or cool and freeze cooked patties for quick breakfasts."
          ]
        },
        {
          "name": "Pizza (Carle Version)",
          "category": "Main Dishes (Veg/Cheese)",
          "servings": "4–6 servings",
          "ingredients": [
            "1 package (about 6.5 oz / 185 g) Pizza crust mix (or equivalent homemade dough for one 12–14 inch pan)",
            "as needed Nonstick vegetable cooking spray",
            "1–2 tablespoons for pan Cornmeal",
            "1–1 1/2 cups Pizza sauce (such as Ragu Pizza natural sauce)",
            "1 small, thinly sliced Onion",
            "1/4–1/3 cup, quartered Black olives",
            "1 can (4 oz), drained Canned mushrooms",
            "1 small, sliced Bell pepper",
            "1/2–1 cup, cut in strips Ham or turkey ham",
            "2–3 cups, grated or sliced Mozzarella cheese"
          ],
          "instructions": [
            "Preheat oven to 450°F (230°C). Prepare the pizza crust dough according to package or recipe directions.",
            "Spray a round or rectangular pizza pan with nonstick cooking spray and sprinkle with 1–2 tablespoons (10–20 g) cornmeal.",
            "Place the dough in the center of the pan. With damp fingertips, gently press and stretch the dough out to the edges, keeping the thickness even.",
            "Par-bake the crust for 8–10 minutes, until just set and lightly golden at the edges.",
            "Remove from the oven and spread 1–1 1/2 cups (240–360 ml) pizza sauce over the crust, leaving a small border.",
            "Distribute sliced onion, olives, mushrooms, bell pepper, and ham or turkey ham evenly over the sauce.",
            "Return the pizza to the oven and bake for 10–15 minutes, until the toppings are hot and the crust is golden.",
            "Remove from the oven, top generously with grated or sliced Mozzarella cheese, and bake 5–8 minutes more, until the cheese is melted and bubbly.",
            "Cool a few minutes, then cut into wedges or squares and serve."
          ]
        },
        {
          "name": "Fettuccine Primavera",
          "category": "Main Dishes (Veg/Cheese)",
          "servings": "6 servings",
          "ingredients": [
            "8 oz, uncooked Fettuccine",
            "1 cup Broccoli florets",
            "1 cup Carrot slices",
            "1 3/4 cups Whole milk",
            "1 package (8 oz), cubed Light neufchatel cheese",
            "1/2 cup, chopped Green onion",
            "1/2 teaspoon Italian seasoning",
            "1/4 teaspoon Garlic powder",
            "1 cup, cubed Cooked smoked turkey breast",
            "1/2 cup Grated Parmesan cheese"
          ],
          "instructions": [
            "Bring a large pot of salted water to a boil. Add fettuccine and cook according to package directions.",
            "During the last 5 minutes of pasta cooking time, add the broccoli florets and carrot slices to the boiling water with the pasta.",
            "While the pasta cooks, combine the milk, neufchatel cheese, green onion, Italian seasoning, and garlic powder in a medium saucepan.",
            "Cook over low heat, stirring frequently, until the cheese is fully melted and the sauce is smooth and slightly thickened.",
            "Stir the smoked turkey and Parmesan cheese into the sauce and heat gently until warmed through. Do not boil.",
            "Drain the pasta and vegetables well and return them to the pot or a large serving bowl.",
            "Pour the hot sauce over the pasta and vegetables and toss gently to coat.",
            "Serve immediately, with extra Parmesan at the table if desired."
          ]
        },
        {
          "name": "Baked Lasagna Casserole",
          "category": "Main Dishes (Beef & Pork)",
          "servings": "8-10 servings",
          "ingredients": [
            "8 oz (about 12 noodles) Lasagna noodles",
            "2 tablespoons Olive oil or vegetable oil",
            "1 pound Ground beef",
            "1, finely minced Medium onion",
            "1 clove, minced Garlic",
            "1 teaspoon Chopped fresh parsley",
            "2 cans (6 oz each) Tomato paste",
            "2 cups Water",
            "1/2 teaspoon Salt",
            "1/2 teaspoon Black pepper",
            "2 large Eggs",
            "3/4 pound (about 1 1/2 cups) Ricotta cheese or cottage cheese",
            "3/4 pound, sliced or shredded Mozzarella cheese",
            "1/2 cup Grated Parmesan cheese"
          ],
          "instructions": [
            "Cook the lasagna noodles according to package directions until al dente. Drain, rinse with cool water, and lay flat on a towel to prevent sticking.",
            "Meanwhile, heat the oil in a large heavy skillet or saucepan over medium heat. Add the ground beef, onion, garlic, and parsley. Cook, breaking up the meat with a spoon, until the beef is browned and the onion is tender.",
            "Stir in the tomato paste, water, salt, and pepper. Bring to a simmer, then reduce heat to low and simmer gently for 1 hour, stirring occasionally. The sauce should thicken.",
            "In a medium bowl, beat the eggs lightly, then stir in the ricotta or cottage cheese until well combined.",
            "Preheat oven to 375°F (190°C). Lightly coat a 13x9x2-inch baking dish with nonstick spray.",
            "Spread about 1/2 cup of the meat sauce over the bottom of the prepared dish.",
            "Layer 4 lasagna noodles over the sauce, overlapping slightly. Spread half of the ricotta mixture over the noodles, then add a third of the remaining sauce, and a third of the mozzarella.",
            "Repeat the layers: noodles, remaining ricotta mixture, half of the remaining sauce, and half of the remaining mozzarella.",
            "Top with the remaining noodles, the rest of the sauce, the rest of the mozzarella, and sprinkle generously with Parmesan cheese.",
            "Cover with aluminum foil and bake for 25 minutes. Remove the foil and bake for an additional 10-15 minutes, or until the cheese is bubbly and lightly golden.",
            "Let the lasagna stand for 10-15 minutes before cutting into squares and serving."
          ]
        },
        {
          "name": "Tofu-Cheese Stuffed Shells",
          "category": "Main Dishes (Veg/Cheese)",
          "servings": "4 servings (12 shells)",
          "ingredients": [
            "12 Jumbo pasta shells",
            "1/4 cup Shredded carrot",
            "2 tablespoons, sliced Green onion",
            "8 oz, drained Firm tofu",
            "1/2 cup ricotta cheese",
            "1/2 cup Shredded cheddar cheese",
            "1/2 cup, divided Shredded mozzarella cheese",
            "1 large, beaten Egg white",
            "1/4 teaspoon each Salt and pepper",
            "1 can (14.5 oz), undrained Canned diced tomatoes",
            "3 oz (half a 6-oz can) Tomato paste",
            "1 teaspoon Dried basil",
            "1 teaspoon Dried oregano",
            "1/2 teaspoon Granulated sugar",
            "1/4 teaspoon Garlic powder",
            "1/4 teaspoon (optional) Fennel seeds, crushed"
          ],
          "instructions": [
            "Cook the jumbo pasta shells according to package directions until al dente. Drain, rinse with cold water, and set aside on a towel.",
            "In a small saucepan, cook the shredded carrot and green onion in 2-3 tablespoons of water until tender, about 3-4 minutes. Drain well.",
            "In a medium bowl, mash the tofu with a fork until crumbly.",
            "Add the cooked carrot and green onion, ricotta, cheddar, 1/4 cup of the mozzarella, beaten egg white, salt, and pepper. Mix well.",
            "In a medium saucepan, combine the undrained diced tomatoes, tomato paste, basil, oregano, sugar, garlic powder, and fennel seeds (if using).",
            "Bring to a boil, then reduce heat and simmer uncovered for 10 minutes, stirring occasionally.",
            "Preheat oven to 350°F (175°C).",
            "Spoon about 1/3 of the tomato sauce into the bottom of an ungreased 8x8x2-inch baking dish.",
            "Stuff each cooked shell with a heaping tablespoon of the tofu-cheese filling.",
            "Arrange the stuffed shells in a single layer in the baking dish.",
            "Pour the remaining sauce over the shells, covering them evenly.",
            "Sprinkle the remaining 1/4 cup mozzarella cheese over the top.",
            "Cover with aluminum foil and bake for 25 minutes, or until hot and bubbly.",
            "Let stand 5 minutes before serving."
          ]
        },
        {
          "name": "Beef Brisket (Marinaded)",
          "category": "Main Dishes (Beef & Pork)",
          "servings": "8-10 servings",
          "ingredients": [
            "5 to 6 pounds Beef brisket (trimmed)",
            "1/4 cup (2 oz) Soy sauce (low-sodium if preferred)",
            "1/4 cup (2 oz) Worcestershire sauce",
            "1 tablespoon Liquid smoke (hickory or mesquite)",
            "1 teaspoon Hot sauce (Louisiana-style (such as Tabasco or Crystal))",
            "1 teaspoon Garlic powder (optional, for extra flavor)",
            "2 teaspoons Dried basil (crushed)",
            "1/2 teaspoon Brown sugar",
            "1/2 teaspoon Black pepper (freshly ground)"
          ],
          "instructions": [
            "In a small bowl, whisk together the soy sauce, Worcestershire sauce, liquid smoke, hot sauce, garlic powder (if using), basil, brown sugar, and black pepper until the sugar dissolves.",
            "Place the brisket in a large resealable plastic bag or a shallow glass or ceramic dish. Pour the marinade over the brisket, turning to coat all sides. Seal the bag or cover the dish tightly with plastic wrap.",
            "Refrigerate for 24 hours, turning the brisket several times to ensure even marination.",
            "When ready to cook, preheat the oven to 250°F (120°C).",
            "Remove the brisket from the marinade and place it fat-side up in a roasting pan or Dutch oven. Pour any remaining marinade over the top. Cover the pan tightly with heavy-duty aluminum foil or a tight-fitting lid to seal in moisture.",
            "Bake for 6 to 7 hours, until the brisket is fork-tender and the internal temperature reaches at least 190–200°F (88–93°C) for best tenderness.",
            "Remove from the oven and let the brisket rest, covered, for 10–15 minutes before slicing.",
            "Transfer the brisket to a cutting board. Slice thinly across the grain using a sharp knife or electric knife. Slicing against the grain ensures tender, easy-to-chew slices.",
            "Serve hot with the pan juices spooned over the slices. Excellent with mashed potatoes, roasted vegetables, or in sandwiches."
          ]
        },
        {
          "name": "Salmon Croquettes",
          "category": "Main Dishes (Seafood)",
          "servings": "4 servings (8 small croquettes)",
          "ingredients": [
            "15 ounces (1 can) Canned salmon (drained, bones and skin removed)",
            "2 tablespoons Onion (finely minced)",
            "1 large Egg (lightly beaten)",
            "1/2 to 3/4 cup Soda crackers or saltines (finely crushed (about 12–15 crackers))",
            "1/4 to 1/2 teaspoon Tabasco or hot sauce (or to taste)",
            "1/4 teaspoon Black pepper (freshly ground)",
            "1 teaspoon Lemon juice (optional, for brightness)",
            "2 to 3 tablespoons Vegetable oil or butter (for pan-frying)"
          ],
          "instructions": [
            "Drain the canned salmon thoroughly. Place it in a mixing bowl and use a fork to flake it, removing any large bones and skin (though small soft bones are safe and add calcium).",
            "Add the minced onion, beaten egg, Tabasco or hot sauce, black pepper, and lemon juice (if using). Mix gently to combine.",
            "Stir in the crushed crackers, a little at a time, until the mixture holds together when pressed into a patty. It should be moist but not wet. If too dry, add a teaspoon of water or milk; if too wet, add more cracker crumbs.",
            "Shape the mixture into 8 small patties, about 2 1/2 to 3 inches in diameter and about 1/2 inch thick. Place on a plate.",
            "Heat 2 tablespoons of vegetable oil or butter in a large skillet over medium heat until shimmering.",
            "Carefully place the croquettes in the skillet, working in batches if necessary to avoid crowding. Cook for 3–4 minutes per side, until golden brown and crispy. Handle gently when flipping to keep them intact.",
            "Transfer the cooked croquettes to a plate lined with paper towels to drain excess oil.",
            "Serve hot with lemon wedges, tartar sauce, or a side of coleslaw and cornbread. Enjoy!"
          ]
        },
        {
          "name": "Macaroni, Ham, and Cheese",
          "category": "Main Dishes (Beef & Pork)",
          "servings": "8-10 servings",
          "ingredients": [
            "2 cups (8 oz) Elbow macaroni (uncooked)",
            "1 pound Turkey ham (diced or cubed)",
            "15 ounces (about 3 3/4 cups) Sharp cheddar cheese (shredded, reduced-fat if preferred)",
            "1/2 slice Bread (torn into small pieces)",
            "1 large Egg (or 1/4 cup large eggs)",
            "about 1/2 cup total Milk (2% or whole)"
          ],
          "instructions": [
            "Preheat oven to 350°F (175°C). Coat a 9x13x2-inch baking dish with nonstick cooking spray.",
            "Cook the macaroni according to package directions until al dente. Drain well and set aside.",
            "If you have a meat grinder with a large-hole plate, grind the turkey ham and shredded cheese together. Run the 1/2 slice of bread through the grinder to collect any remaining cheese and ham. Mix well. If you don't have a grinder, finely chop or dice the ham and mix it with the shredded cheese and torn bread pieces.",
            "In a small bowl, beat the egg (or large eggs) and add enough milk to make 1/2 cup total liquid. Mix well.",
            "Begin layering in the prepared casserole: Start with a layer of the ham-cheese mixture, then a layer of cooked macaroni. Repeat, alternating layers, and end with a layer of ham and cheese on top.",
            "Pour the egg-milk mixture evenly over the entire casserole.",
            "Bake uncovered for 25-30 minutes, or until the top is golden and the casserole is bubbly and heated through.",
            "Let stand for 5 minutes before serving. Serve hot with a green salad or steamed vegetables."
          ]
        },
        {
          "name": "Sweet and Sour Roast",
          "category": "Main Dishes (Beef & Pork)",
          "servings": "8 servings",
          "ingredients": [
            "4 pounds Beef chuck roast or chicken pieces (trimmed of excess fat)",
            "3 tablespoons Vegetable oil",
            "1 large clove Garlic (minced or crushed)",
            "2 medium Onions (sliced)",
            "1 can (14 oz) Beef or chicken broth (low-sodium if preferred)",
            "2 Bay leaves",
            "2 tablespoons Vinegar or lemon juice (white or apple cider vinegar)",
            "1 tablespoon Brown sugar (packed)",
            "1 small can (8 oz) Tomato sauce",
            "1/2 cup Raisins (golden or dark)"
          ],
          "instructions": [
            "Heat the vegetable oil in a large Dutch oven or heavy pot over medium-high heat.",
            "Brown the meat on all sides, working in batches if necessary. This should take about 8-10 minutes total. Remove the meat and set aside.",
            "In the same pot, add the minced garlic and sliced onions. Sauté for 2-3 minutes until fragrant and the onions begin to soften.",
            "Return the browned meat to the pot. Add the broth, bay leaves, vinegar or lemon juice, and brown sugar. Stir to combine.",
            "Bring to a simmer, then reduce heat to low. Cover and simmer gently for about 1 hour, or until the meat is tender. Check occasionally and add a little water if needed.",
            "Stir in the tomato sauce and raisins. Continue simmering, covered, for another 30 minutes.",
            "Remove the bay leaves before serving.",
            "Serve hot over cooked long-grain white rice, with the sauce spooned over the top. Excellent with steamed vegetables on the side."
          ]
        },
        {
          "name": "Scalloped Salmon",
          "category": "Main Dishes (Seafood)",
          "servings": "2 servings",
          "ingredients": [
            "2 tablespoons Onion (finely chopped)",
            "1 tablespoon Green bell pepper (finely chopped)",
            "2 tablespoons Butter (divided)",
            "1 can (7 3/4 oz) Canned salmon (drained and flaked, bones removed)",
            "1/2 cup Evaporated milk",
            "1 tablespoon All-purpose flour",
            "1/4 teaspoon Salt (or to taste)",
            "1/8 teaspoon Black pepper (optional)",
            "2-3 tablespoons Soft bread crumbs (fresh, from about 1 slice bread)",
            "1 teaspoon Melted butter (for bread crumbs)"
          ],
          "instructions": [
            "Preheat oven to 400°F (200°C). Lightly coat 2 individual baking shells or ramekins (about 1-cup capacity each) with butter-flavored nonstick cooking spray.",
            "In a small skillet, melt 2 tablespoons of unsalted butter or butter over medium heat. Add the chopped onion and green pepper. Sauté for 3-4 minutes, until tender but not browned.",
            "In a medium bowl, combine the flaked salmon, evaporated milk, flour, salt, and black pepper (if using). Mix well.",
            "Add the sautéed onion and pepper (along with any butter from the pan) to the salmon mixture. Stir to combine.",
            "Divide the salmon mixture evenly between the prepared baking shells or ramekins.",
            "In a small bowl, toss the soft bread crumbs with 1 teaspoon melted unsalted butter or butter. Sprinkle the buttered crumbs evenly over the tops of the salmon mixture.",
            "Bake for 15 minutes, or until the tops are golden brown and the filling is bubbly.",
            "Serve hot with a side of steamed vegetables, rice, or a green salad. Excellent with lemon wedges for squeezing over the top."
          ]
        },
        {
          "name": "Chicken/Brown Rice Bake",
          "category": "Main Dishes (Poultry)",
          "servings": "6-8 servings",
          "ingredients": [
            "1/2 cup, chopped Yellow onion",
            "2 tablespoons Vegetable oil",
            "2 teaspoons Curry powder (adjust to taste)",
            "3 cups Low-sodium chicken broth (fat skimmed off)",
            "1 cup, uncooked Brown rice",
            "16 ounces (1 bag) Frozen mixed vegetables (carrots, peas, corn, green beans)",
            "2 cups, chopped Cooked chicken or turkey (about 1 lb)",
            "1 cup Additional chicken broth or water (recommended for better texture)"
          ],
          "instructions": [
            "Preheat oven to 350°F (175°C). Coat a 12x8x2-inch baking dish with nonstick cooking spray.",
            "In a large skillet or saucepan, heat the vegetable oil over medium heat. Add the chopped onion and sauté for 3-4 minutes, until crisp-tender.",
            "Stir in the curry powder and cook for 1 minute, stirring constantly. This blooms the curry spices and enhances their flavor.",
            "Add the 3 cups of chicken broth and bring to a boil. Cover, reduce heat to low, and simmer for 15 minutes.",
            "Stir in the uncooked brown rice. Cover and continue to cook over low heat for 50-60 minutes, or until the liquid is mostly absorbed and the rice is tender. Check occasionally and add a bit more liquid if needed.",
            "Once the rice is cooked, stir in the frozen mixed vegetables, chopped chicken (or turkey), and the additional 1 cup of broth or water. Mix well.",
            "Transfer the mixture to the prepared baking dish and spread evenly.",
            "Cover tightly with foil and bake for 30-35 minutes, or until heated through and the vegetables are tender.",
            "Let stand for 5 minutes before serving. This dish pairs well with a crisp salad and crusty bread."
          ]
        },
        {
          "name": "Chicken Casserole",
          "category": "Main Dishes (Poultry)",
          "servings": "8-10 servings",
          "ingredients": [
            "14 ounces (1 package) Seasoned bread stuffing mix",
            "1/2 cup (1 stick) Butter (melted)",
            "1/4 cup Water",
            "2 1/2 cups, diced Cooked chicken (about 1 lb cooked)",
            "1/2 cup, chopped Yellow onion",
            "1/4 cup, chopped Green onions or fresh chives",
            "1/2 cup, chopped Celery",
            "1/2 cup Mayonnaise (can use light mayo)",
            "3/4 teaspoon Salt",
            "2 large Eggs (or 1/2 cup large eggs)",
            "1 1/2 cups Milk",
            "2 cans (10.5 oz each) Condensed cream of mushroom soup (can use reduced-fat)"
          ],
          "instructions": [
            "Coat a 9x13-inch baking dish with nonstick cooking spray.",
            "In a large bowl, combine the bread stuffing mix, melted unsalted butter, and 1/4 cup water. Toss until the stuffing is moistened.",
            "Spread half of the stuffing mixture evenly in the bottom of the prepared baking dish.",
            "In another bowl, combine the diced chicken, chopped onion, green onions (or chives), celery, mayonnaise, and salt. Mix well.",
            "Spread the chicken mixture evenly over the stuffing layer in the casserole dish.",
            "Top with the remaining stuffing mixture, spreading it evenly.",
            "In a medium bowl, lightly beat the eggs. Whisk in the milk until well combined.",
            "Pour the egg-milk mixture evenly over the entire casserole, trying to moisten all areas.",
            "Cover the dish tightly with aluminum foil and refrigerate overnight (or for at least 4 hours).",
            "When ready to bake, remove the casserole from the refrigerator and let it sit at room temperature for 1 hour.",
            "Preheat oven to 325°F (165°C).",
            "Spread the 2 cans of cream of mushroom soup evenly over the top of the casserole.",
            "Bake uncovered for 1 hour, or until the casserole is hot and bubbly and the top is lightly browned.",
            "Let stand for 10 minutes before serving. This is a perfect make-ahead dish for entertaining!"
          ]
        },
        {
          "name": "Chicken/Rice Casserole",
          "category": "Main Dishes (Poultry)",
          "servings": "8 servings",
          "ingredients": [
            "8 pieces Chicken breasts (bone-in or boneless, or 1 whole fryer cut up)",
            "1 can (10.5 oz) Condensed cream of mushroom soup",
            "1 can (10.5 oz) Condensed cream of chicken or celery soup",
            "2 2/3 cups (2 soup cans) Water",
            "1 1/2 cups, uncooked Long-grain white rice",
            "1/2 cup (1 stick) Butter (melted)",
            "to taste Salt and pepper"
          ],
          "instructions": [
            "Preheat oven to 300°F (150°C). Coat a large 9x13-inch casserole dish or baking pan with nonstick cooking spray.",
            "In a large bowl, whisk together the cream of mushroom soup, cream of chicken (or celery) soup, and 2 soup cans of water until smooth.",
            "Stir the uncooked rice into the soup mixture until well combined.",
            "Pour the rice and soup mixture into the prepared casserole dish and spread evenly.",
            "Dip each piece of chicken in the melted unsalted butter, coating both sides. Season the chicken with salt and pepper to taste.",
            "Arrange the chicken pieces on top of the rice mixture in a single layer.",
            "Cover the dish tightly with aluminum foil.",
            "Bake for about 2 hours, or until the chicken is cooked through (internal temperature of 165°F) and the rice is tender.",
            "Remove the foil during the last 15-20 minutes of baking to allow the chicken to brown on top.",
            "Let stand for 5-10 minutes before serving. The rice will absorb the flavorful juices from the chicken and soup."
          ]
        },
        {
          "name": "Jumbo Shells No. 1 (Spinach-Ricotta)",
          "category": "Main Dishes (Veg/Cheese)",
          "servings": "20 stuffed shells (6-8 servings)",
          "ingredients": [
            "1 pound Fresh spinach (or 10 oz frozen chopped spinach, thawed)",
            "1 tablespoon, chopped Yellow onion",
            "1 tablespoon Butter",
            "1 large, beaten Egg (or 1/4 cup large eggs)",
            "2/3 cup Ricotta cheese (part-skim or whole milk)",
            "1/2 cup Grated Parmesan cheese",
            "1/8 teaspoon Ground nutmeg",
            "20 Jumbo pasta shells (cooked according to package directions)",
            "3-4 cups Marinara or tomato sauce (homemade or jarred)"
          ],
          "instructions": [
            "Cook the jumbo pasta shells according to package directions until al dente. Drain and set aside.",
            "If using fresh spinach: In a large saucepan, combine the spinach with 2-3 tablespoons of water. Cover and simmer for 3-5 minutes until wilted. Drain well and squeeze out as much excess moisture as possible. Chop finely.",
            "If using frozen spinach: Thaw completely and squeeze out all excess moisture. Chop if pieces are large.",
            "In a small skillet, melt the unsalted butter over medium heat. Add the chopped onion and cook for 3-4 minutes, until tender but not browned.",
            "Add the chopped spinach to the skillet and stir to combine. Heat through for 1-2 minutes. Remove from heat.",
            "In a medium bowl, combine the beaten egg, ricotta cheese, Parmesan cheese, nutmeg, and the spinach-onion mixture. Mix well.",
            "Preheat oven to 350°F (175°C).",
            "Spread half of the tomato sauce in the bottom of a 9x13-inch baking dish.",
            "Carefully stuff each cooked shell with about 2 tablespoons of the spinach-ricotta filling. Arrange the stuffed shells in the baking dish in a single layer.",
            "Pour the remaining tomato sauce over the top of the shells, covering them evenly.",
            "Cover the dish with aluminum foil and bake for 30 minutes, or until hot and bubbly.",
            "Let stand for 5 minutes before serving. Garnish with additional Parmesan cheese if desired."
          ]
        },
        {
          "name": "Jumbo Shells No. 2 (Meat Filling)",
          "category": "Main Dishes (Beef & Pork)",
          "servings": "20 stuffed shells (6-8 servings)",
          "ingredients": [
            "1 pound Ground beef or ground chicken (lean)",
            "1 tablespoon Olive oil (for sautéing)",
            "1 large, beaten Egg (or 1/4 cup large eggs)",
            "1/4 cup Grated Parmesan cheese",
            "1/4 cup Italian seasoned bread crumbs",
            "1 tablespoon, chopped Fresh parsley",
            "1/2 teaspoon Salt (or to taste)",
            "1/4 teaspoon Black pepper (or to taste)",
            "20 Jumbo pasta shells (cooked according to package directions)",
            "3-4 cups Marinara or tomato sauce (homemade or jarred)"
          ],
          "instructions": [
            "Cook the jumbo pasta shells according to package directions until al dente. Drain and set aside.",
            "In a large skillet, heat the olive oil over medium-high heat. Add the ground beef (or chicken) and sauté, breaking it up with a spoon, until fully browned and cooked through, about 8-10 minutes.",
            "Drain any excess fat from the cooked meat and transfer it to a mixing bowl. Let cool slightly.",
            "To the cooled meat, add the beaten egg, Parmesan cheese, bread crumbs, chopped parsley, salt, and pepper. Mix well until all ingredients are thoroughly combined.",
            "Preheat oven to 350°F (175°C).",
            "Spread half of the tomato sauce in the bottom of a 9x13-inch baking dish.",
            "Carefully stuff each cooked shell with about 2 tablespoons of the meat filling. Arrange the stuffed shells in the baking dish in a single layer.",
            "Pour the remaining tomato sauce over the top of the shells, covering them evenly.",
            "Cover the dish with aluminum foil and bake for 30 minutes, or until hot and bubbly.",
            "Let stand for 5 minutes before serving. These can be served with a side salad and garlic bread for a complete meal."
          ]
        },
        {
          "name": "Chili",
          "category": "Main Dishes (Beef & Pork)",
          "servings": "6-8 servings",
          "ingredients": [
            "1 pound Boneless chicken breast (cooked and diced)",
            "1 pound Lean ground chuck (browned and drained)",
            "2 cans (15 oz each) Kidney beans (drained and rinsed)",
            "2 cans (14.5 oz each) Diced tomatoes (with juices)",
            "1 can (8 oz) Tomato sauce",
            "1 Large onion (diced)",
            "2-3 tablespoons Chili powder (adjust to taste)",
            "1 tablespoon Ground cumin",
            "1 teaspoon Garlic powder",
            "1 teaspoon Salt (or to taste)",
            "1/2 teaspoon Black pepper (or to taste)"
          ],
          "instructions": [
            "In a large pot or Dutch oven, brown the ground chuck over medium-high heat until fully cooked. Drain excess fat.",
            "Add the diced cooked chicken to the pot.",
            "Stir in the kidney beans, diced tomatoes (with their juices), and tomato sauce.",
            "Add the diced onion, chili powder, cumin, and garlic powder. Stir well to combine.",
            "Season with salt and pepper to taste.",
            "Bring the mixture to a boil, then reduce heat to low.",
            "Cover and simmer for 30-45 minutes, stirring occasionally to prevent sticking.",
            "Taste and adjust seasonings as needed.",
            "Serve hot with cornbread, crackers, or over rice. Top with shredded cheese, sour cream, or chopped green onions if desired.",
            "Note: A favorite of all the grandchildren: Becca, Drew, Alex, Hunter, and Chris."
          ]
        },
        {
          "name": "Spaghetti Portotino (Serves One)",
          "category": "Main Dishes (Seafood)",
          "servings": "1 serving",
          "ingredients": [
            "2 tablespoons Fresh garlic, minced (in oil)",
            "2 pats (about 1 tablespoon) Butter",
            "2-3 ounces Red snapper or halibut filets (cut into small strips)",
            "1/2 ounce (1 tablespoon) Brandy",
            "1/2 cup Fresh mussels (cleaned; if not available, increase fish to 4-5 oz)",
            "1 tablespoon Worcestershire sauce",
            "1/4 teaspoon Soy sauce",
            "1/4 teaspoon Dried oregano",
            "1/4 teaspoon Tabasco sauce (or to taste)",
            "1/2 cup Chunky tomato sauce",
            "4 tablespoons Catsup",
            "2 teaspoons Fresh parsley, chopped",
            "3 ounces (6 tablespoons) White wine",
            "2 ounces dry (1 oz cooked) Spaghetti (about 1 cup cooked)"
          ],
          "instructions": [
            "Cook spaghetti according to package directions; drain and set aside.",
            "In a medium skillet, warm the minced garlic in oil and butter over medium heat.",
            "Add the fish strips and sauté for about 1 minute until they start to turn opaque.",
            "Carefully add the brandy and ignite with a long match or lighter. Let the flames burn out naturally (about 30 seconds).",
            "Add the mussels, Worcestershire sauce, soy sauce, oregano, and Tabasco. Stir gently.",
            "Stir in the chunky tomato sauce, catsup, parsley, and white wine. Bring to a simmer.",
            "Add the cooked spaghetti to the sauce and toss to combine.",
            "Simmer for 1-2 minutes until everything is heated through.",
            "Serve immediately with a green salad and warm French bread.",
            "Note: Original recipe brought from Cozumel, Mexico by Ed & Mary Carle."
          ]
        },
        {
          "name": "Spaghetti Portotino (Serves Six)",
          "category": "Main Dishes (Seafood)",
          "servings": "6 servings",
          "ingredients": [
            "8 large cloves Fresh garlic, minced (about 3 tablespoons)",
            "3 tablespoons Olive oil",
            "2 tablespoons Butter, melted",
            "1 1/2 pounds Red snapper or halibut filets (cut into small strips)",
            "1/2 cup Brandy (such as Napoleon or other quality brandy)",
            "3 tablespoons Worcestershire sauce",
            "2 tablespoons Soy sauce",
            "2 tablespoons Fresh basil, chopped (or 2 teaspoons dried)",
            "1 teaspoon Tabasco sauce (or to taste)",
            "2 cups Chunky tomato sauce",
            "1/2 cup Catsup",
            "2 tablespoons Fresh parsley, chopped",
            "1/2 cup White wine",
            "1 pound dry (17 oz cooked) Spaghetti"
          ],
          "instructions": [
            "Cook spaghetti according to package directions; drain and set aside.",
            "In a large wok or deep skillet, warm the minced garlic in olive oil and melted unsalted butter over medium heat.",
            "Add the fish strips and sauté for about 3 minutes until they start to turn opaque and are nearly cooked through.",
            "Carefully add the brandy. If desired, you can ignite it with a long match for dramatic presentation. Let flames burn out naturally.",
            "Add the Worcestershire sauce, soy sauce, fresh basil, and Tabasco. Stir gently to combine.",
            "Stir in the chunky tomato sauce, catsup, parsley, and white wine.",
            "Add the cooked spaghetti to the wok and toss everything together.",
            "Bring to a gentle simmer and cook for 2-3 minutes until everything is heated through and well combined.",
            "Taste and adjust seasonings as needed.",
            "Serve immediately in large pasta bowls with a green salad and warm French bread.",
            "Note: Original recipe brought from Cozumel, Mexico by Ed & Mary Carle."
          ]
        }
      ]
    },
    {
      "name": "Side Dishes",
      "recipes": [
        {
          "name": "Royal Rice",
          "category": "Side Dishes",
          "servings": "6 servings",
          "ingredients": [
            "3 cups, lightly packed Cooked long-grain rice (cooked in chicken or beef broth)",
            "1/2 cup, finely chopped Green onions (including tops)",
            "2 tablespoons Butter",
            "1 can (4 ounces), drained Sliced mushrooms, canned",
            "1 teaspoon, or to taste Salt",
            "1/4 teaspoon, or to taste Black pepper"
          ],
          "instructions": [
            "Prepare the rice ahead of time in chicken or beef broth so it is cooked, fluffy, and still warm or at room temperature.",
            "In a large skillet, melt the unsalted butter or butter over medium heat.",
            "Add the chopped green onions and saute 3–4 minutes until tender but not browned.",
            "Stir in the drained mushrooms and cook 1–2 minutes more.",
            "Add the cooked rice, breaking up any clumps with a fork or spatula. Sprinkle with salt and black pepper.",
            "Toss gently over medium heat until the rice is hot throughout and evenly coated with the butter and vegetables.",
            "Taste and adjust seasoning with additional salt or pepper, if needed.",
            "Fluff with a fork and serve hot as a side dish with roasted or grilled meats or fish."
          ]
        },
        {
          "name": "Hush Puppies",
          "category": "Side Dishes",
          "servings": "About 20–24 hush puppies",
          "ingredients": [
            "2 cups Water",
            "1 cup, leveled Fine or medium-grain cornmeal",
            "1 teaspoon Salt",
            "1 large Egg",
            "2–3 tablespoons (optional) Onion, very finely minced",
            "1 clove (optional) Garlic, finely minced",
            "As needed for deep or shallow frying Oil or fat for frying"
          ],
          "instructions": [
            "In a medium saucepan, bring the water to a full boil over medium-high heat.",
            "If using onion and/or garlic, stir them into the boiling water and cook 1 minute to soften.",
            "Reduce heat to low. While stirring constantly with a wooden spoon or whisk, slowly pour in the cornmeal in a thin stream to avoid lumps.",
            "Cook, stirring continuously, until the mixture is thick and pulls away from the sides of the pan, 2–4 minutes.",
            "Remove from heat. Stir in the salt, then add the egg and mix quickly until fully incorporated and the batter is smooth and thick.",
            "Let the mixture stand until it is cool enough to handle and firm enough to shape, about 15–20 minutes.",
            "With slightly damp hands, scoop about 1 tablespoon of dough at a time and roll into short logs or small balls, about finger size. Set formed hush puppies on a parchment-lined tray.",
            "Heat frying oil or reserved fish-frying fat in a deep pot or skillet to 350–365°F (175–185°C).",
            "Fry the hush puppies in batches without crowding, turning occasionally, until deep golden brown and crisp on the outside, 3–4 minutes.",
            "Remove with a slotted spoon and drain on paper towels. Sprinkle lightly with extra salt while hot, if desired.",
            "Serve warm alongside fried fish or other seafood."
          ]
        },
        {
          "name": "Broccoli and Rice",
          "category": "Side Dishes",
          "servings": "6-8 servings",
          "ingredients": [
            "1/2 cup (1 stick) Butter",
            "1, finely chopped Small onion",
            "1 package (10 oz) Frozen chopped broccoli",
            "1 jar (8 oz) or 1 cup Processed cheese sauce (such as Cheese Whiz)",
            "1 can (10.5 oz) Cream of chicken soup",
            "3 cups Cooked long-grain white rice (from 1 cup uncooked)",
            "to taste Salt",
            "to taste Black pepper"
          ],
          "instructions": [
            "Preheat oven to 350°F (175°C). Coat a 2-quart baking dish with nonstick cooking spray.",
            "In a large skillet, melt the unsalted butter over medium heat. Add the chopped onion and sauté for 3–4 minutes until softened.",
            "Add the frozen broccoli to the skillet. Cook, stirring occasionally, until the broccoli is tender and heated through, about 5–7 minutes.",
            "Stir in the cheese sauce and cream of chicken soup, mixing until the cheese is fully melted and the mixture is smooth.",
            "Add the cooked rice and stir until everything is well combined. Season with salt and pepper to taste.",
            "Transfer the mixture to the prepared baking dish and spread evenly.",
            "Bake for 20–30 minutes, or until the casserole is hot throughout and bubbling around the edges.",
            "Let stand for 5 minutes before serving. Serve as a side dish with chicken, pork, or beef."
          ]
        }
      ]
    },
    {
      "name": "Breads, Rolls & Breakfast",
      "recipes": [
        {
          "name": "Banana Nut Bread",
          "category": "Breads, Rolls & Breakfast",
          "servings": "1 loaf (about 12 slices)",
          "ingredients": [
            "1 cup Granulated sugar",
            "1/2 cup (1 stick) Butter (softened)",
            "2 large eggs (or 1/2 cup substitute) Eggs or large eggs",
            "2 cups All-purpose flour",
            "1 teaspoon Baking soda",
            "1/2 teaspoon Ground cinnamon",
            "1/2 teaspoon Ground cloves",
            "3 medium Ripe bananas (mashed (about 1 1/2 cups))",
            "1/2 cup Chopped walnuts or pecans"
          ],
          "instructions": [
            "Preheat oven to 325°F (165°C). Coat a 9×5-inch loaf pan with nonstick spray or line with parchment paper.",
            "In a large bowl, cream together the sugar and softened unsalted butter until light and fluffy.",
            "Beat in the eggs (or large eggs) until well combined.",
            "In a separate bowl, whisk together the flour, baking soda, cinnamon, and cloves.",
            "Add the dry ingredients to the creamed mixture and stir until just combined (do not overmix).",
            "Fold in the mashed bananas and chopped nuts until evenly distributed.",
            "Pour the batter into the prepared loaf pan and smooth the top.",
            "Bake for 60–70 minutes, or until a toothpick inserted in the center comes out clean.",
            "Let cool in the pan for 10 minutes, then turn out onto a wire rack to cool completely before slicing."
          ]
        },
        {
          "name": "Cranberry Bread",
          "category": "Breads, Rolls & Breakfast",
          "servings": "1 loaf (about 12 slices)",
          "ingredients": [
            "2 cups All-purpose flour",
            "1 cup Sugar",
            "2 teaspoons Baking powder",
            "1/2 teaspoon Baking soda",
            "1/2 teaspoon Salt",
            "about 1/2 cup Fresh orange juice (from 1 large orange)",
            "about 2 tablespoons Grated orange rind (from 1 large orange)",
            "as needed to make 3/4 cup total liquid Water",
            "1 large, beaten Egg",
            "2 tablespoons Vegetable or salad oil",
            "2 cups, halved Fresh or frozen cranberries",
            "1/2 cup Chopped walnuts or pecans"
          ],
          "instructions": [
            "Preheat oven to 325°F (165°C). Grease a 9x5-inch loaf pan or coat with nonstick spray.",
            "In a large bowl, whisk together the flour, sugar, baking powder, baking soda, and salt.",
            "In a separate bowl or measuring cup, combine the fresh orange juice and grated rind, then add enough water to make 3/4 cup total liquid. Stir in the beaten egg and oil.",
            "Pour the wet ingredients into the dry ingredients and stir just until moistened and combined. The batter will be slightly lumpy.",
            "Gently fold in the halved cranberries and chopped nuts, distributing them evenly.",
            "Pour the batter into the prepared loaf pan and spread evenly.",
            "Bake for 50–60 minutes, or until a toothpick inserted in the center comes out clean and the top is golden brown.",
            "Cool in the pan for 10 minutes, then turn out onto a wire rack to cool completely.",
            "For best flavor and easier slicing, wrap and refrigerate overnight before serving."
          ]
        },
        {
          "name": "Pumpkin Bread",
          "category": "Breads, Rolls & Breakfast",
          "servings": "3 loaves",
          "ingredients": [
            "3 1/2 cups, sifted All-purpose flour",
            "2 teaspoons Baking soda",
            "1 1/2 teaspoons Salt",
            "2 teaspoons Ground cinnamon",
            "2 teaspoons Ground nutmeg",
            "3 cups Sugar",
            "4 large, beaten Eggs",
            "2/3 cup Water",
            "1 cup Vegetable oil",
            "2 cups (one 15-oz can) Pumpkin puree",
            "1 cup Chopped pecans"
          ],
          "instructions": [
            "Preheat oven to 350°F (175°C). Generously grease three 1-pound coffee cans or three 8x4-inch loaf pans, or spray with nonstick cooking spray.",
            "In a large mixing bowl, whisk together the sifted flour, baking soda, salt, cinnamon, nutmeg, and sugar.",
            "In a separate bowl, combine the beaten eggs, water, vegetable oil, and pumpkin puree. Whisk until smooth and well blended.",
            "Pour the wet ingredients into the dry ingredients and stir just until combined. Do not overmix.",
            "Fold in the chopped pecans, distributing them evenly throughout the batter.",
            "Divide the batter evenly among the three prepared cans or loaf pans, filling each about two-thirds full.",
            "Bake for 60–70 minutes, or until a toothpick or skewer inserted in the center comes out clean.",
            "Let the loaves cool in the cans or pans for 10–15 minutes, then carefully turn out onto a wire rack to cool completely.",
            "Wrap the cooled loaves in plastic wrap or foil and let rest overnight for easier slicing and richer flavor."
          ]
        },
        {
          "name": "Waffles",
          "category": "Breads, Rolls & Breakfast",
          "servings": "6-8 waffles",
          "ingredients": [
            "2 cups All-purpose flour",
            "3 teaspoons Baking powder",
            "1 teaspoon Salt",
            "2 large, separated Eggs",
            "2 cups Milk",
            "1/4 cup Vegetable oil",
            "1 tablespoon (optional) Sugar"
          ],
          "instructions": [
            "Preheat your waffle iron according to the manufacturer's instructions.",
            "In a large bowl, whisk together the flour, baking powder, salt, and sugar (if using).",
            "Separate the eggs, placing the whites in a clean bowl and the yolks in another.",
            "Beat the egg yolks lightly, then whisk in the milk and vegetable oil.",
            "Pour the wet ingredients into the dry ingredients and stir just until combined. Some lumps are okay.",
            "In a separate bowl, beat the egg whites with an electric mixer until stiff peaks form.",
            "Gently fold the beaten egg whites into the batter using a rubber spatula. Do not overmix.",
            "Pour the batter onto the preheated waffle iron (amount will vary by waffle maker size).",
            "Cook until the waffles are golden brown and crisp, usually 3-5 minutes depending on your waffle iron.",
            "Serve immediately with butter, syrup, fresh fruit, or your favorite toppings."
          ]
        },
        {
          "name": "Cinnamon Rolls",
          "category": "Breads, Rolls & Breakfast",
          "servings": "18-24 rolls",
          "ingredients": [
            "4 1/2-5 cups, divided All-purpose flour",
            "2 packets (4 1/2 tsp) Active dry yeast",
            "1/2 cup Milk",
            "1/2 cup Water",
            "1/2 cup Granulated sugar",
            "1/3 cup Vegetable oil",
            "1 1/2 teaspoons Salt",
            "4 large Egg whites",
            "1/4 cup, melted Butter (for filling)",
            "3/4 cup, packed Brown sugar (for filling)",
            "2-3 tablespoons Ground cinnamon (for filling)",
            "1 cup Confectioners' sugar (for glaze)",
            "2-3 tablespoons Milk or cream (for glaze)"
          ],
          "instructions": [
            "In a large bowl, combine 2 cups flour with the yeast and mix well.",
            "In a small saucepan, heat the milk, water, 1/2 cup sugar, oil, and salt over low heat until warm (120-130°F), stirring to dissolve the sugar.",
            "Pour the warm liquid into the flour-yeast mixture. Beat with an electric mixer for 2-3 minutes until smooth.",
            "Beat in the egg whites until incorporated.",
            "Add 1 more cup of flour and beat for 1 minute.",
            "Gradually stir in enough of the remaining flour to make a dough that is too stiff to stir.",
            "Turn the dough out onto a floured surface and knead for 8-10 minutes, adding flour as needed, until smooth and elastic.",
            "Place the dough in a greased bowl, turning to coat. Cover and let rise in a warm place (80-85°F) until doubled, about 1 1/2-2 hours.",
            "Punch down the dough and let rest for 10 minutes.",
            "Roll the dough into a large rectangle, about 1/2-inch thick.",
            "Brush the dough generously with melted unsalted butter or butter.",
            "Mix the brown sugar and cinnamon together and sprinkle evenly over the buttered dough.",
            "Starting from a long edge, roll the dough tightly into a log. Cut into 1-inch slices.",
            "Place the rolls in greased 9x13-inch pans, leaving space between them. Spray the tops lightly with cooking spray.",
            "Cover and let rise until doubled, 30-45 minutes.",
            "Preheat oven to 375°F (190°C).",
            "Bake for 20-25 minutes, or until golden brown.",
            "While the rolls bake, make the glaze by whisking together confectioners' sugar and enough milk to make a drizzling consistency.",
            "Drizzle the glaze over warm rolls and serve."
          ]
        },
        {
          "name": "Cornmeal Yeast Rolls",
          "category": "Breads, Rolls & Breakfast",
          "servings": "36 rolls",
          "ingredients": [
            "1 packet (2 1/4 tsp) Active dry yeast",
            "1/4 cup (105-115°F) Warm water",
            "1 3/4 cups Milk",
            "1/3 cup Granulated sugar",
            "1/4 cup Vegetable oil",
            "1/4 cup Butter",
            "1 teaspoon Salt",
            "1/2 cup Large Eggs or 2 eggs",
            "1 1/2 cups Yellow cornmeal",
            "5-5 1/2 cups, divided All-purpose flour"
          ],
          "instructions": [
            "In a large bowl, dissolve the yeast in warm water. Let stand for 5 minutes until foamy.",
            "In a small saucepan, heat the milk, sugar, oil, unsalted butter, and salt over low heat until the unsalted butter melts. Stir well and cool to 105-115°F.",
            "Add the cooled milk mixture to the yeast mixture.",
            "Stir in the large eggs, cornmeal, and 2 cups of the flour.",
            "Beat with an electric mixer on medium speed for 2 minutes until smooth.",
            "Gradually stir in enough of the remaining flour to form a soft dough.",
            "Turn the dough out onto a lightly floured surface and knead for about 8 minutes, adding flour as needed, until smooth and elastic.",
            "Place the dough in a greased bowl, turning to coat all sides. Cover and let rise in a warm place (about 85°F) until doubled in size, about 1 hour.",
            "Punch down the dough and divide into 36 equal pieces. Shape each piece into a smooth ball.",
            "Place the balls on greased or parchment-lined baking sheets, spacing them about 2 inches apart.",
            "Cover and let rise in a warm place for 45 minutes, or until doubled in size.",
            "Preheat oven to 375°F (190°C).",
            "Bake for 12-15 minutes, or until the rolls are golden brown.",
            "Brush the hot rolls lightly with melted butter or spray with butter-flavored cooking spray.",
            "Remove from the pans immediately and serve warm."
          ]
        },
        {
          "name": "Basic Sweet Dough",
          "category": "Breads, Rolls & Breakfast",
          "servings": "About 24 rolls or 2 loaves",
          "ingredients": [
            "4 1/2 to 5 cups, sifted All purpose flour (divided)",
            "2 packages (4 1/2 teaspoons) Active dry yeast",
            "1/2 cup Milk (any fat percentage)",
            "1/2 cup Water",
            "1/2 cup Granulated sugar",
            "1/3 cup Vegetable oil (plus extra for brushing)",
            "1 1/2 teaspoons Salt",
            "4 large Egg whites (or 1/2 cup liquid egg whites)"
          ],
          "instructions": [
            "In a large mixing bowl, combine 2 cups of the flour with the yeast. Whisk together to distribute the yeast evenly.",
            "In a small saucepan, combine the milk, water, sugar, 1/3 cup oil, and salt. Warm over low heat, stirring occasionally, until the mixture reaches 120–130°F and the sugar dissolves. It should feel warm but not hot to the touch.",
            "Pour the warm liquid into the flour-yeast mixture. Beat with an electric mixer on low speed for 30 seconds, scraping the bowl frequently, then beat on high speed for 2–3 minutes until smooth. (Or beat vigorously by hand for about 300 strokes.)",
            "Add the egg whites and beat until incorporated.",
            "Mix in 1 more cup of flour and beat for 1 minute.",
            "Gradually stir in enough of the remaining flour (about 1 1/2 to 2 cups) to make a dough that is too stiff to stir.",
            "Turn the dough out onto a lightly floured surface. Knead for 8–10 minutes, adding small amounts of flour as needed, until the dough is smooth, elastic, and no longer sticky. Proper kneading develops the gluten and creates a light, airy texture.",
            "Shape the dough into a ball. Place it in a large bowl lightly coated with nonstick spray or oil. Turn the dough once to coat the surface. Cover with a clean kitchen towel or plastic wrap.",
            "Let the dough rise in a warm, draft-free place (80–85°F) until doubled in size, about 1 1/2 to 2 hours. To test, gently press two fingers into the dough; if the indentation remains, the dough is ready.",
            "Punch down the dough to release the air. Let it rest for 10 minutes.",
            "Shape the dough as desired: rolls, buns, cinnamon rolls, coffee cakes, or loaves. Place shaped dough into pans coated with nonstick spray. Lightly brush the tops with oil to prevent drying.",
            "Cover and let rise again in a warm place until nearly doubled in size, 30–45 minutes.",
            "Preheat the oven to 350°F (175°C).",
            "Bake for 20–25 minutes (rolls and buns) or 30–35 minutes (loaves), until golden brown. The bread should sound hollow when tapped on the bottom.",
            "Remove from pans and let cool on a wire rack. Serve warm or at room temperature."
          ]
        },
        {
          "name": "Dinner Rolls",
          "category": "Breads, Rolls & Breakfast",
          "servings": "About 12-15 rolls",
          "ingredients": [
            "3 to 3 1/2 cups Bread flour or all-purpose flour (sifted, divided)",
            "1 packet (2 1/4 tsp) Active dry yeast",
            "1 cup Milk (any fat percentage)",
            "2 tablespoons Vegetable oil",
            "2 tablespoons Granulated sugar",
            "1 teaspoon Salt"
          ],
          "instructions": [
            "In a large bowl, combine about 1 cup of the flour with the yeast. Whisk together to distribute the yeast evenly.",
            "In a small saucepan, combine the milk, oil, sugar, and salt. Heat over low heat, stirring occasionally, until warm to the touch (110-115°F) and the sugar and salt dissolve. The mixture should feel warm but not hot.",
            "Pour the warm liquid into the flour-yeast mixture. Beat with an electric mixer at medium speed for 2 minutes, or beat vigorously by hand for about 300 strokes, until smooth.",
            "Add 1/2 to 1 cup more flour and beat for an additional 1 minute.",
            "Gradually stir in enough of the remaining flour (about 1 1/2 to 2 cups) to form a soft dough that pulls away from the sides of the bowl.",
            "Turn the dough out onto a lightly floured surface. Knead for 8-10 minutes, adding small amounts of flour as needed, until the dough is smooth, elastic, and no longer sticky.",
            "Lightly coat a large bowl with nonstick spray. Place the dough in the bowl and turn once to coat. Cover with plastic wrap or a damp towel.",
            "Let the dough rise in a warm, draft-free place (80-85°F) until doubled in size, about 1 hour. To test, gently press two fingers into the dough; if the indentation remains, it's ready.",
            "Punch down the dough to release the air. Turn out onto a lightly floured surface and shape into desired forms: round rolls, cloverleaf, Parker House, crescents, etc.",
            "Place shaped rolls on lightly greased baking sheets or in muffin tins, spacing them about 2 inches apart. Cover and let rise again until nearly doubled, 1 to 1 1/2 hours.",
            "Preheat the oven to 425°F (220°C).",
            "Bake for 10-12 minutes, or until the rolls are golden brown on top.",
            "Serve piping hot with butter. Store leftovers in an airtight container for up to 3 days, or freeze for up to 1 month."
          ]
        },
        {
          "name": "Crumble Coffee Cake #2",
          "category": "Breads, Rolls & Breakfast",
          "servings": "4-5 cakes (8-inch square)",
          "ingredients": [
            "1 full batch Basic Sweet Dough (prepared to thick batter consistency (see Basic Sweet Dough recipe))",
            "2 1/2 cups All-purpose flour (for crumble topping)",
            "2 cups Granulated sugar (for crumble topping)",
            "1 teaspoon Vanilla extract",
            "2 large Eggs (or 1/2 cup large eggs)",
            "12 tablespoons (1 1/2 sticks) Butter (softened)",
            "2 teaspoons Baking powder"
          ],
          "instructions": [
            "Prepare one full batch of Basic Sweet Dough according to the recipe, but add a bit more liquid so the dough reaches a thick cake batter consistency rather than a standard bread dough texture.",
            "Coat 4 to 5 eight-inch square baking pans with nonstick cooking spray.",
            "Divide the dough evenly among the pans. Spread to about 3/8-inch thickness (it will rise during proofing). The dough should cover the bottom of each pan.",
            "Prepare the crumble topping: In a medium bowl, combine the sugar, vanilla, eggs (or large eggs), softened unsalted butter, and baking powder. Mix until well blended.",
            "Gradually work in the flour, mixing and rubbing the mixture between your fingers until crumbles form. The crumbles should vary in size, with the largest about the size of a blueberry.",
            "Sprinkle the crumble topping evenly over each unbaked coffee cake, distributing it as uniformly as possible.",
            "Cover the pans lightly and let the cakes rise in a warm place for about 1 hour, or until noticeably puffy.",
            "Preheat the oven to 375°F (190°C).",
            "Bake for 20-25 minutes, or until the cakes are golden brown and the crumble topping is lightly crisped.",
            "Cool in the pans for 10 minutes, then cut into squares and serve warm or at room temperature. Excellent with coffee or tea!"
          ]
        },
        {
          "name": "Stöllen",
          "category": "Breads, Rolls & Breakfast",
          "servings": "6 small loaves",
          "ingredients": [
            "2 cups (1 pint) Milk (any fat percentage)",
            "2 packets (4 1/2 tsp) Active dry yeast",
            "8 cups All-purpose flour (sifted, divided)",
            "1 pound (4 sticks) Butter (softened, reserve 3 tbsp)",
            "1 cup Granulated sugar (plus extra for topping)",
            "4 large Eggs (or 1 cup large eggs)",
            "3/4 to 1 pound Candied fruit mix and/or Muscat raisins (seeded raisins)",
            "1/2 cup Rum (can substitute rum extract)",
            "from 1 lemon Fresh lemon zest (finely grated)",
            "1 teaspoon Salt",
            "1/2 cup Chopped almonds",
            "3 tablespoons Rosewater (adjust to taste)"
          ],
          "instructions": [
            "Scald the milk and let it cool to lukewarm (110°F). In a medium bowl, combine 1 cup of the flour, the lukewarm milk, and the yeast. Mix well, cover, and set in a warm place to rise until light and bubbly, about 30-45 minutes.",
            "Meanwhile, combine the candied fruit, raisins, and grated lemon zest in a bowl. Pour the rosewater and rum over the fruit mixture. Cover and set aside to macerate.",
            "In a large mixing bowl, cream together the softened unsalted butter (reserving 3 tablespoons) and 1 cup sugar until light and fluffy. Add the eggs one at a time, beating well after each addition.",
            "In a very large bowl or on a clean work surface, place the remaining 7 cups of flour and the salt. Make a well in the center. Add the creamed unsalted butter mixture, the yeast sponge, and the fruit mixture (including any liquid). Mix well by hand, working the ingredients together and adding a bit more flour if the dough is too sticky.",
            "Knead the dough on a lightly floured surface for about 8-10 minutes, until smooth and not too sticky. Place in a greased bowl, cover, and let rise in a warm place until doubled in size, about 1-2 hours.",
            "Punch down the dough and divide it into 6 equal portions. Shape each portion into a round lump, then flatten slightly into an oval.",
            "Melt the reserved 3 tablespoons of unsalted butter. Brush each oval with melted unsalted butter, then sprinkle with sugar and chopped almonds. Fold each oval in half lengthwise and place in a greased baking pan.",
            "Brush the tops with additional melted unsalted butter. Cover and let rise in a warm place until puffy, about 45-60 minutes.",
            "Preheat oven to 350°F (175°C). Bake for 40-60 minutes, or until golden brown and the bread sounds hollow when tapped. If the tops brown too quickly, tent with foil.",
            "Cool on wire racks. Dust with powdered sugar before serving if desired. Stöllen keeps well and improves with age when wrapped tightly."
          ]
        },
        {
          "name": "Stöllen (Kanis Recipe)",
          "category": "Breads, Rolls & Breakfast",
          "servings": "Multiple loaves (large holiday batch)",
          "ingredients": [
            "1 1/2 to 4 pounds Granulated sugar (use 1 1/2 lbs for less sweet version)",
            "about 2 pounds total Mixed candied fruit (cherries, citron, lemon peel, orange peel, pineapple) (chopped)",
            "1/4 pound Raisins (optional)",
            "1/2 cup Whiskey or brandy (for macerating fruit)",
            "1/2 pound Chopped almonds",
            "1/2 pound Chopped pecans",
            "1 pound (4 sticks) Butter (plus extra for brushing)",
            "6 large Eggs (or 1 1/2 cups large eggs)",
            "1 tablespoon Salt",
            "1 quart Milk",
            "6 packets Active dry yeast",
            "7 to 12 pounds All-purpose flour (use enough for stiff dough)",
            "from 2 lemons Fresh lemon zest (finely grated)",
            "1 tablespoon Rosewater",
            "1 teaspoon Almond extract"
          ],
          "instructions": [
            "The night before: In a large bowl, combine all the candied fruit, raisins (if using), and sugar. Pour 1/2 cup whiskey over the mixture, stir well, cover, and let macerate overnight.",
            "The next morning: Add the chopped almonds and pecans to the fruit mixture.",
            "In a very large mixing bowl, cream together the butter, eggs, salt, and remaining sugar until well combined.",
            "Warm the milk to lukewarm (110°F) and dissolve the yeast in it. Let stand for 5 minutes until foamy.",
            "Add the yeast mixture, the fruit-nut mixture, lemon zest, rosewater, and almond extract to the creamed butter mixture. Mix well.",
            "Gradually add flour, starting with about 7 pounds, mixing and kneading until you have a stiff dough that is smooth but not sticky. Add more flour as needed, up to 12 pounds total.",
            "Cover the dough and let it rise slowly in a cool place for a long time—overnight is ideal. The slow rise develops flavor.",
            "The next day, turn the dough out onto a lightly floured surface. Handle gently. Roll or pat out lightly to about 1 inch thickness.",
            "Cut the dough into portions of about 1 1/2 pounds each. Shape each portion into a loaf by folding and tucking the edges under.",
            "Place the loaves on greased baking sheets. Cover and let rise again until puffy, about 1-2 hours.",
            "Preheat oven to 325°F (165°C). Bake for about 1 hour, or until golden brown and the loaves sound hollow when tapped.",
            "While still hot, brush the tops with melted butter or unsalted butter. Mix some powdered sugar with almond extract and rub this almond-flavored sugar on top of each loaf.",
            "Cool completely before slicing. Stöllen improves with age and can be stored for weeks when wrapped tightly."
          ]
        },
        {
          "name": "Dinner Roll Shapes",
          "category": "Breads, Rolls & Breakfast",
          "servings": "Varies by shape",
          "ingredients": [
            "1 batch Prepared dinner roll dough (from Basic Sweet Dough or Dinner Rolls recipe)",
            "2-4 tablespoons Softened butter (for brushing)",
            "As needed Nonstick vegetable spray"
          ],
          "instructions": [
            "Prepare your favorite dinner roll dough recipe and let it rise until doubled.",
            "Punch down the dough and divide as needed for the shapes you wish to make.",
            "FOR CLOVERLEAF ROLLS: Pinch off small pieces of dough and roll into balls about 1/2 inch in diameter. Lightly spray muffin cups with nonstick spray. Place 3 balls in each muffin cup to form a cloverleaf shape. Let rise until doubled, then bake at 375°F (190°C) for 12-15 minutes until golden.",
            "FOR CRESCENT ROLLS: Roll dough to 1/4-inch thickness. Cut into 6-inch circles, then cut each circle into 6 wedges (or roll into a 3-inch-wide rectangle and cut into triangles). Brush with melted unsalted butter. Starting at the wide end, roll up each triangle and curve into a crescent shape. Place on greased baking sheet, let rise until doubled, then bake at 375°F (190°C) for 12-15 minutes.",
            "FOR PARKERHOUSE ROLLS: Roll dough to 1/4-inch thickness. Cut with a 3-inch biscuit cutter. Use a spoon handle to make a crease just below center of each circle. Brush with unsalted butter. Fold the top half over the bottom half (bottom should be slightly larger). Place on greased baking sheet, let rise until doubled, then bake at 375°F (190°C) for 12-15 minutes.",
            "FOR FANTAN ROLLS: Roll dough into a rectangle 1/8-inch thick. Cut into 1-inch-wide strips. Brush with melted unsalted butter. Stack 6-7 strips on top of each other. Cut the stack into 1 1/4-inch pieces. Place each piece cut-side up in greased muffin cups. Let rise until doubled, then bake at 375°F (190°C) for 12-15 minutes.",
            "All shapes should be golden brown when done. Brush with additional butter if desired while still warm."
          ]
        },
        {
          "name": "Corn Bread - Southern Style (Restored)",
          "category": "Breads, Rolls & Breakfast",
          "servings": "9 servings (9-inch square)",
          "ingredients": [
            "1 1/2 cups (250g) Yellow cornmeal (stone-ground preferred)",
            "1/2 cup (65g) All-purpose flour",
            "2 tablespoons (25g) Granulated sugar",
            "1 tablespoon (15g) Baking powder",
            "1 teaspoon (5g) Salt",
            "1 1/4 cups (300ml) Whole buttermilk",
            "2 Large eggs (lightly beaten)",
            "1/3 cup (80ml) Melted butter or bacon drippings"
          ],
          "instructions": [
            "Preheat oven to 425°F (220°C). Place 1 tablespoon of butter or bacon drippings in a 9-inch square cast iron skillet or baking pan and place in the oven to heat.",
            "In a large mixing bowl, whisk together the cornmeal, flour, sugar, baking powder, and salt.",
            "In a separate bowl, whisk together the buttermilk, beaten eggs, and melted butter (or remaining bacon drippings).",
            "Pour the wet ingredients into the dry ingredients and stir with a wooden spoon just until moistened. Do not overmix.",
            "Carefully remove the hot skillet from the oven. Swirl to coat the bottom with the melted fat.",
            "Pour the batter into the hot skillet (it should sizzle).",
            "Bake for 20-25 minutes, or until the top is golden brown and a toothpick inserted in the center comes out clean.",
            "Serve warm with butter."
          ],
          "notes": [
            "Restored to original family version using whole ingredients and metric measurements."
          ]
        },
        {
          "name": "Corn Bread - Southern Style With Buttermilk (Variation)",
          "category": "Breads, Rolls & Breakfast",
          "servings": "8-9 servings",
          "ingredients": [
            "1 cup Yellow cornmeal",
            "1 cup All-purpose flour",
            "1/4 cup Granulated sugar",
            "2 teaspoons Baking powder",
            "1/2 teaspoon Baking soda",
            "1/2 teaspoon Salt",
            "1 cup buttermilk",
            "1 Large egg (lightly beaten)",
            "1/4 cup Vegetable oil"
          ],
          "instructions": [
            "Preheat oven to 400°F (200°C). Grease an 8-inch square baking pan or coat with nonstick spray.",
            "In a large bowl, whisk together the cornmeal, flour, sugar, baking powder, baking soda, and salt.",
            "In a separate bowl, whisk together the buttermilk, egg, and vegetable oil until well combined.",
            "Pour the wet ingredients into the dry ingredients and stir just until combined. Do not overmix; some small lumps are okay.",
            "Pour the batter into the prepared pan and spread evenly.",
            "Bake for 20-22 minutes, or until the top is golden brown and a toothpick inserted in the center comes out clean.",
            "Let cool for 5 minutes before cutting into squares.",
            "Serve warm with butter or as a side to soups, chilis, and stews.",
            "Note: This recipe was revised on December 24, 1995 for improved texture and flavor."
          ]
        },
        {
          "name": "Dinner Roll Shapes",
          "category": "Breads, Rolls & Breakfast",
          "servings": "18-24 rolls (varies by shape)",
          "ingredients": [
            "1 cup Warm water (105-115°F (40-46°C))",
            "1 packet (2 1/4 teaspoons) Active dry yeast",
            "1/4 cup Granulated sugar",
            "1 teaspoon Salt",
            "2 tablespoons Butter (softened)",
            "1 Large egg (at room temperature)",
            "3 to 3 1/2 cups All-purpose flour (plus more for kneading)",
            "2-3 tablespoons Additional butter (melted, for brushing)"
          ],
          "instructions": [
            "In a large bowl, dissolve the yeast in warm water. Let stand 5 minutes until foamy.",
            "Add the sugar, salt, softened unsalted butter, egg, and 2 cups of the flour to the yeast mixture. Beat with a mixer or wooden spoon until smooth.",
            "Gradually stir in enough of the remaining flour (1 to 1 1/2 cups) to make a soft dough that pulls away from the sides of the bowl.",
            "Turn the dough out onto a lightly floured surface and knead for about 5 minutes, until smooth and elastic.",
            "Place the dough in a greased bowl, turning once to coat all sides. Cover with a clean towel and let rise in a warm place until doubled in size, about 1 hour.",
            "Punch down the dough to release air bubbles. At this point, you can shape the rolls in various forms:",
            "",
            "FOR CLOVERLEAF ROLLS: Pinch off dough and form into small balls about 1/2 inch in diameter. Place 3 balls in each greased muffin cup.",
            "",
            "FOR CRESCENT ROLLS: Roll dough to 1/4-inch thickness and cut into 6-inch circles. Cut each circle into 6-8 wedges. Brush with melted unsalted butter. Starting at the wide end, roll up each wedge and curve into a crescent shape. Place on greased baking sheet.",
            "",
            "FOR PARKERHOUSE ROLLS: Roll dough to 1/4-inch thickness. Cut with a 3-inch biscuit cutter. Make a crease just below the center of each circle with a knife handle or spoon. Brush with melted unsalted butter. Fold the top half over the bottom half (bottom should be slightly larger). Place on greased baking sheet.",
            "",
            "FOR FANTAN ROLLS: Roll dough into a rectangle about 1/8-inch thick. Cut into 1-inch-wide strips. Brush with melted unsalted butter. Stack 6-7 strips on top of each other. Cut the stack into 1 1/4-inch pieces. Place each piece cut-side up in a greased muffin cup.",
            "",
            "Cover shaped rolls and let rise in a warm place until doubled, about 30 minutes.",
            "Preheat oven to 375°F (190°C).",
            "Bake for 12-15 minutes, or until golden brown.",
            "Brush with additional melted butter if desired. Serve warm."
          ]
        },
        {
          "name": "Fluffy Buttermilk Biscuits",
          "category": "Breads, Rolls & Breakfast",
          "servings": "About 10-12 biscuits",
          "ingredients": [
            "1 3/4 cups, sifted All-purpose flour",
            "2 teaspoons Baking powder",
            "1/2 teaspoon Baking soda",
            "1/2 teaspoon Salt",
            "1/4 cup Vegetable oil",
            "1 cup buttermilk",
            "1/2 teaspoon Butter flavoring (optional)"
          ],
          "instructions": [
            "Preheat oven to 450°F (230°C). Lightly coat a baking sheet with nonstick spray.",
            "In a large bowl, sift together the flour, baking powder, baking soda, and salt.",
            "In a small bowl or measuring cup, combine the vegetable oil, buttermilk, and butter flavoring (if using). Do not stir—just combine them gently.",
            "Pour the liquid mixture all at once into the dry ingredients.",
            "Stir quickly with a fork just until the mixture clings together and forms a shaggy ball. Do not overmix.",
            "Turn the dough out onto a lightly floured board or clean work surface.",
            "Using just your fingertips (not your palms), gently knead the dough 10-12 times until it just comes together.",
            "Pat or roll the dough out to 1/2 to 1 inch thickness.",
            "Cut biscuits with a floured 2-inch biscuit cutter, pressing straight down without twisting.",
            "Place the biscuits on the prepared baking sheet.",
            "Bake for 10-12 minutes, or until the tops are golden brown.",
            "Serve hot with butter, jam, or honey."
          ]
        },
        {
          "name": "Pizza Dough (Crusty)",
          "category": "Breads, Rolls & Breakfast",
          "servings": "Dough for two 12-inch pizzas or one large sheet pizza",
          "ingredients": [
            "1 package (2 1/4 teaspoons) Active dry yeast",
            "1 cup Warm water (105-115°F (40-46°C))",
            "1/2 teaspoon Salt",
            "2 teaspoons Olive oil",
            "2 1/2 to 3 1/2 cups All-purpose flour (start with 2 1/2 cups)",
            "for dusting Cornmeal"
          ],
          "instructions": [
            "In a large warmed mixing bowl, sprinkle the yeast over the warm water. Let stand for 5 minutes until the yeast is foamy.",
            "Stir in the salt, olive oil, and 2 1/2 cups of the flour. Mix with a wooden spoon or a stand mixer with a dough hook for about 2 minutes.",
            "Gradually add more flour, 1/2 cup at a time, mixing or kneading until the dough clings together, pulls away from the sides of the bowl, and is no longer sticky.",
            "Knead the dough for 5 minutes (by hand on a floured surface or with a dough hook) until smooth and elastic.",
            "Place the dough in a bowl coated with nonstick spray or lightly oiled. Turn the dough to coat all sides.",
            "Cover the bowl with a damp towel or plastic wrap and let rise in a warm place (about 80°F) until doubled in size, about 1 hour.",
            "Punch down the dough to release air bubbles.",
            "Divide the dough in half for two round pizzas, or leave whole for one large sheet pizza.",
            "On a lightly floured surface, roll out each portion into the desired shape and thickness.",
            "Transfer to a pizza pan or baking sheet sprinkled with cornmeal.",
            "Top with your favorite pizza toppings.",
            "Bake at 425°F (220°C) for 18-22 minutes, or until the crust is golden and crispy and the cheese is bubbly."
          ]
        }
      ]
    },
    {
      "name": "Salads",
      "recipes": [
        {
          "name": "Bean Salad",
          "category": "Salads",
          "servings": "8-10 servings",
          "ingredients": [
            "1 can (14-15 oz) Green beans (drained and rinsed)",
            "1 can (14-15 oz) Whole kernel corn (drained)",
            "1 can (14-15 oz) Kidney beans or lima beans (drained and rinsed)",
            "1 cup Celery (diced)",
            "1 cup Onion (chopped)",
            "1 large Green bell pepper (diced)",
            "1 large (or 1 jar pimento) Red bell pepper or pimento (diced)",
            "3/4 cup White vinegar",
            "1 cup Granulated sugar",
            "1/4 cup Water",
            "1 1/2 tablespoons Vegetable oil"
          ],
          "instructions": [
            "In a large bowl, combine the drained green beans, corn, kidney beans, diced celery, chopped onion, and diced peppers.",
            "In a small saucepan, combine the vinegar, sugar, water, and oil. Bring to a boil over medium heat, stirring until the sugar dissolves.",
            "Pour the hot marinade over the vegetables and toss gently to coat.",
            "Cover and refrigerate for at least 4 hours or overnight, stirring occasionally.",
            "Serve chilled as a side salad or on a bed of lettuce."
          ]
        },
        {
          "name": "Blueberry Jello Salad",
          "category": "Salads",
          "servings": "10-12 servings",
          "ingredients": [
            "6 oz box Red raspberry gelatin, family size",
            "3 oz box Red raspberry gelatin, regular size",
            "1 envelope Unflavored gelatin",
            "1/2 cup (for unflavored gelatin) Cold water",
            "1 cup Milk (skim or 2%)",
            "1 scant cup Granulated sugar",
            "2 teaspoons Vanilla extract",
            "8 oz, softened Cream cheese",
            "1/2 cup or more Chopped pecans",
            "15 oz can with juice Blueberries"
          ],
          "instructions": [
            "FIRST LAYER: In a large bowl, dissolve the 6-oz family-size raspberry gelatin in 3 1/2 cups boiling water, stirring until completely dissolved. Pour into a 9x13-inch loaf pan or dish and refrigerate until very firm, about 2–3 hours.",
            "SECOND LAYER: In a small bowl, sprinkle the unflavored gelatin over 1/2 cup cold water and let stand 5 minutes to soften. In a small saucepan, heat the milk and sugar over medium-low heat, stirring, until the sugar dissolves. Do not boil. Add the softened unflavored gelatin and stir until fully dissolved. Remove from heat and stir in the vanilla. Let cool slightly, then whisk in the softened cream cheese until smooth. Stir in the chopped pecans. Let the mixture cool to lukewarm, then gently pour over the firm first layer. Refrigerate until set, about 1–2 hours.",
            "THIRD LAYER: Dissolve the 3-oz regular-size raspberry gelatin in 1 cup boiling water, stirring well. Gently stir in the blueberries and their juice. Let cool to room temperature, then carefully pour over the second layer. Refrigerate until very firm, at least 2–3 hours or overnight.",
            "To serve, cut into squares and serve on lettuce leaves if desired. The three distinct layers create a beautiful presentation."
          ]
        },
        {
          "name": "Oriental Salad",
          "category": "Salads",
          "servings": "12-14 servings",
          "ingredients": [
            "3 bags (10 oz each) Cole slaw mix (about 30 oz total)",
            "12, chopped (about 1 1/2 cups) Green onions",
            "2 packages (3 oz each) Oriental-flavor Ramen noodles (reserve seasoning packets)",
            "1/2 cup Sliced almonds",
            "1/2 cup Sesame seeds",
            "1 teaspoon (for toasting) Sesame oil",
            "1 cup Safflower or canola oil",
            "6 tablespoons Rice vinegar",
            "1/4 cup Sugar",
            "1 teaspoon Salt",
            "1 teaspoon Black pepper",
            "2 (from the noodle packages) Ramen seasoning packets"
          ],
          "instructions": [
            "In a small skillet, toast the sliced almonds and sesame seeds in the sesame oil over medium heat, stirring frequently, until golden and fragrant, about 3–5 minutes. Set aside to cool.",
            "Break the uncooked Ramen noodles into small pieces (discard the seasoning packets for now, or save for the dressing).",
            "In a large salad bowl, combine the cole slaw mix, chopped green onions, broken Ramen noodles, toasted almonds, and toasted sesame seeds. Toss to mix.",
            "In a jar or small bowl, combine the safflower or canola oil, rice vinegar, sugar, salt, pepper, and the two Ramen seasoning packets. Shake or whisk vigorously until well blended and the sugar is dissolved.",
            "Just before serving, pour the dressing over the salad and toss well to coat evenly.",
            "Serve immediately for maximum crunch. If making ahead, keep the dressing separate and toss just before serving to prevent the noodles from becoming soggy."
          ]
        },
        {
          "name": "Raspberry Jello Salad",
          "category": "Salads",
          "servings": "10-12 servings",
          "ingredients": [
            "6 oz box Red raspberry gelatin, family size",
            "15 oz can with juice Blueberries (or 2 cups fresh, frozen and cooked)",
            "1 can (15-20 oz) with juice Pineapple tidbits",
            "1 cup Sour cream",
            "8 oz, softened Cream cheese",
            "1/2 cup Granulated sugar",
            "1/2 cup Chopped pecans or walnuts"
          ],
          "instructions": [
            "Drain the blueberries and pineapple, reserving the juices. Measure the combined juices and add enough boiling water to make 2 cups total liquid.",
            "In a large bowl, dissolve the raspberry gelatin in the 2 cups of hot juice-water mixture, stirring until completely dissolved.",
            "Stir in the drained blueberries and pineapple tidbits. Pour into a 9x13-inch dish and refrigerate until firm, about 3–4 hours.",
            "In a medium bowl, beat together the sour cream, softened cream cheese, and sugar until smooth and creamy.",
            "Spread the cream cheese mixture evenly over the top of the chilled gelatin layer.",
            "Sprinkle the chopped nuts over the creamy topping.",
            "Refrigerate for at least 1 hour before serving. Cut into squares to serve."
          ]
        },
        {
          "name": "Vegetable Relish Salad",
          "category": "Salads",
          "servings": "8-10 servings",
          "ingredients": [
            "1 can (15 oz) White sweet corn (shoe peg style) (drained)",
            "1 can (14.5 oz) French style green beans (reserve 2 tablespoons liquid before draining)",
            "1 can (15 oz) Sweet peas (drained (LeSeur preferred))",
            "1 cup White onion, chopped",
            "1 cup Celery, chopped",
            "1 cup Green bell pepper, chopped",
            "1 jar (2 oz) Diced pimento (drained)",
            "1/2 cup Granulated sugar (for marinade)",
            "1/4 cup Vegetable or salad oil (for marinade)",
            "3/4 cup White vinegar (for marinade)",
            "1 teaspoon Salt (for marinade)",
            "1/2 teaspoon Black pepper (for marinade)",
            "2 tablespoons Reserved green bean juice (from canned beans)"
          ],
          "instructions": [
            "Before draining the green beans, reserve 2 tablespoons of the liquid from the can.",
            "Drain all canned vegetables in a colander. You can save the remaining vegetable juices for soup stock if desired.",
            "In a large bowl, combine the drained corn, green beans, peas, chopped onion, celery, green bell pepper, and pimento.",
            "In a small saucepan, combine the sugar, oil, vinegar, salt, pepper, and reserved green bean juice.",
            "Bring the marinade to a boil over medium-high heat, stirring to dissolve the sugar.",
            "Pour the hot marinade over the vegetables and stir gently to coat everything evenly.",
            "Cover and refrigerate overnight (at least 8 hours) to allow the flavors to blend.",
            "Stir before serving. Serve cold as a side dish or relish.",
            "This salad keeps well in the refrigerator for up to 5 days."
          ]
        }
      ]
    },
    {
      "name": "Soups",
      "recipes": [
        {
          "name": "Carrot Soup",
          "category": "Soups",
          "servings": "4-6 servings",
          "ingredients": [
            "2 tablespoons Butter",
            "3/4 cup Yellow onion (chopped (about 1 small onion))",
            "3/4 cup Celery (chopped (about 2 ribs))",
            "3 cups Carrots (chopped (about 4-5 medium carrots))",
            "4 cups Low-sodium chicken broth (de-fatted)",
            "2 tablespoons Tomato paste",
            "2 tablespoons Uncooked white rice",
            "1/2 cup Evaporated whole milk",
            "1 tablespoon Butter (for finishing)",
            "to taste Salt and white pepper",
            "for garnish Carrot curls (optional)"
          ],
          "instructions": [
            "In a large heavy saucepan or Dutch oven, melt 2 tablespoons of unsalted butter over medium heat.",
            "Add the chopped onion and celery. Cook, stirring occasionally, for about 5 minutes, until softened but not browned.",
            "Stir in the chopped carrots, chicken broth, tomato paste, and raw rice. Bring to a simmer.",
            "Reduce heat and simmer gently for 30 minutes, or until the carrots and rice are very tender.",
            "Working in batches if necessary, puree the soup in a blender or food processor until completely smooth. Alternatively, use an immersion blender directly in the pot.",
            "Return the pureed soup to the pot (if using a blender). Stir in the evaporated milk and remaining tablespoon of unsalted butter.",
            "Season with salt and white pepper to taste. Reheat gently over low heat; do not boil.",
            "Ladle into bowls and garnish with carrot curls, if desired. Serve hot."
          ]
        },
        {
          "name": "Hearty Chowder",
          "category": "Soups",
          "servings": "6-8 servings",
          "ingredients": [
            "2 cups Potatoes (peeled and cubed (about 2 medium))",
            "1 cup Carrots (diced)",
            "1/4 cup (1/2 stick) Butter",
            "1 cup Turkey ham (cubed (about 4-5 oz))",
            "1 clove Garlic (minced, or 1/8 tsp garlic powder)",
            "1/2 cup Celery (finely diced)",
            "1 cup (optional) Broccoli (chopped)",
            "1/2 cup Onion (finely chopped)",
            "1/4 cup All-purpose flour",
            "4 cups Milk (2% or skim)",
            "to taste Salt and freshly ground black pepper"
          ],
          "instructions": [
            "Bring a pot of lightly salted water to a boil. Add the diced carrots and cook for about 5 minutes. Add the cubed potatoes and cook for another 5–7 minutes, until both are just tender. Drain and set aside.",
            "In a large heavy pot or Dutch oven, melt the unsalted butter over medium-low heat.",
            "Add the cubed turkey ham and minced garlic. Cook, stirring occasionally, for about 5 minutes.",
            "Stir in the celery, broccoli (if using), and chopped onion. Continue cooking over low heat, stirring occasionally, until the vegetables are soft but not browned (about 5–7 minutes).",
            "Sprinkle the flour over the vegetable and ham mixture. Stir well to coat everything evenly, and cook for 1–2 minutes to remove the raw flour taste.",
            "Gradually pour in the milk, whisking or stirring constantly to prevent lumps. Cook over medium heat, stirring frequently, until the mixture is smooth and begins to thicken.",
            "Add the cooked potatoes and carrots. Stir gently to combine.",
            "Season with salt and freshly ground black pepper to taste.",
            "Reduce heat to low, cover, and simmer gently for about 10 minutes to let the flavors meld. Do not let the chowder boil, or the milk may curdle.",
            "Serve hot, with crackers or crusty bread on the side."
          ]
        }
      ]
    },
    {
      "name": "Candy",
      "recipes": [
        {
          "name": "Divinity",
          "category": "Candy",
          "servings": "About 36 pieces",
          "ingredients": [
            "2 cups Granulated sugar",
            "1/2 cup Light corn syrup",
            "1/2 cup Water",
            "2 large Egg whites (at room temperature)",
            "1 tablespoon Flavoring extract (vanilla, almond, or your choice)",
            "1 cup Pecans or walnuts (broken into small pieces)"
          ],
          "instructions": [
            "Line a baking sheet with wax paper or parchment, or coat an 8×8-inch pan with nonstick spray.",
            "In a heavy 2-quart saucepan, combine the sugar, corn syrup, and water. Cook over medium heat, stirring constantly, until the sugar dissolves.",
            "Once the sugar is dissolved, stop stirring. Continue cooking without stirring until the mixture reaches 265°F (hard-ball stage) on a candy thermometer. This will take 10-15 minutes.",
            "While the syrup cooks, beat the egg whites in a large bowl with an electric mixer on high speed until stiff peaks form.",
            "When the syrup reaches 265°F, remove it from heat. With the mixer running on medium speed, slowly pour the hot syrup in a thin stream into the beaten egg whites. Be careful—the mixture is very hot.",
            "Continue beating at medium speed until the mixture becomes thick and starts to lose its gloss, about 5-8 minutes.",
            "Stir in the flavoring extract and chopped nuts by hand.",
            "Quickly drop spoonfuls of the mixture onto the prepared wax paper, or spread into the prepared pan and cut into squares when cool.",
            "Let cool completely at room temperature. Store in an airtight container."
          ]
        },
        {
          "name": "Fudge (Cocoa Nut)",
          "category": "Candy",
          "servings": "About 24 pieces",
          "ingredients": [
            "2 cups Granulated sugar",
            "5 tablespoons Unsweetened cocoa powder",
            "3/4 cup Milk (whole or 2%)",
            "2 tablespoons Butter",
            "1 teaspoon Vanilla extract",
            "1 cup Chopped walnuts or pecans"
          ],
          "instructions": [
            "Line an 8×8-inch pan with foil or parchment, or coat it with nonstick spray.",
            "In a heavy 2-quart saucepan, combine the sugar, cocoa powder, and milk. Stir over medium heat until the sugar dissolves and the mixture is smooth.",
            "Once the sugar is dissolved, clip a candy thermometer to the side of the pan. Stop stirring and cook without stirring over very low heat until the mixture reaches soft-ball stage (234-238°F). This will take 20-30 minutes.",
            "Remove from heat and add the unsalted butter. Do not stir—just let it melt on top.",
            "Let the mixture cool undisturbed to lukewarm (about 110°F), about 30-45 minutes.",
            "Add the vanilla and beat vigorously with a wooden spoon until the fudge thickens and loses its gloss, about 5-10 minutes.",
            "Stir in the chopped nuts.",
            "Quickly pour the fudge into the prepared pan and smooth the top.",
            "Let cool completely, then cut into squares. Store in an airtight container."
          ]
        },
        {
          "name": "Peanut Brittle (Munching)",
          "category": "Candy",
          "servings": "About 1 pound (24-30 pieces)",
          "ingredients": [
            "1 cup Granulated sugar",
            "1/2 cup Light corn syrup",
            "1/8 teaspoon Salt",
            "1 cup Raw peanuts (unsalted)",
            "1 teaspoon Butter",
            "1 teaspoon Vanilla extract",
            "1 teaspoon Baking soda"
          ],
          "instructions": [
            "Coat a large rimmed baking sheet with nonstick spray or use a nonstick baking mat.",
            "In a microwave-safe 1 1/2-quart or 2-quart glass bowl, stir together the sugar, corn syrup, salt, and peanuts until well combined.",
            "Microwave on HIGH for 4 minutes.",
            "Remove and stir well. Microwave on HIGH for an additional 3-5 minutes, until the mixture turns light golden brown and the peanuts are toasted. Watch carefully to avoid burning.",
            "Carefully remove from microwave (mixture will be extremely hot). Stir in the unsalted butter and vanilla until well blended.",
            "Microwave on HIGH for 1-2 minutes more, until the syrup is very hot and the peanuts are golden.",
            "Immediately stir in the baking soda—the mixture will foam up dramatically. Stir quickly until well mixed and foamy.",
            "Quickly pour the hot mixture onto the prepared baking sheet and spread as thin as possible with a greased spatula.",
            "Let cool completely, about 30-60 minutes.",
            "Break into pieces and store in an airtight container. For Pecan Brittle, substitute 1 1/2 cups pecan halves for peanuts and coconut extract for vanilla."
          ]
        },
        {
          "name": "Pralines, Old Fashioned",
          "category": "Candy",
          "servings": "About 18-24 pralines",
          "ingredients": [
            "1 cup Granulated sugar",
            "1 cup Light brown sugar (firmly packed)",
            "2 cups Pecan halves or pieces (coarsely chopped)",
            "3/4 cup Buttermilk",
            "2 tablespoons Butter",
            "1/4 teaspoon Salt",
            "1/2 teaspoon Baking soda",
            "1 tablespoon Vanilla extract"
          ],
          "instructions": [
            "Line 2 baking sheets with wax paper or parchment, and lightly coat with nonstick spray.",
            "In a large, heavy saucepan (at least 3-quart), combine the granulated sugar, brown sugar, pecans, buttermilk, unsalted butter, and salt.",
            "Cook over low heat, stirring gently, until both sugars dissolve completely.",
            "Cover the pan and cook over medium heat for 2-3 minutes. This creates steam that washes sugar crystals off the sides of the pan.",
            "Uncover and clip a candy thermometer to the side. Cook, stirring constantly, until the mixture reaches soft-ball stage (234-238°F). This will take about 10-15 minutes.",
            "Remove from heat. Stir in the baking soda and vanilla—the mixture will foam up.",
            "Beat vigorously with a wooden spoon until the mixture begins to thicken and lose its gloss, about 2-3 minutes.",
            "Working quickly, drop tablespoonfuls of the mixture onto the prepared wax paper, spacing them about 2 inches apart.",
            "Let the pralines cool completely until firm, about 30 minutes. Store in an airtight container with wax paper between layers."
          ]
        },
        {
          "name": "Fudge (Plain)",
          "category": "Candy",
          "servings": "About 36 pieces",
          "ingredients": [
            "2 cups Granulated sugar",
            "3 tablespoons Unsweetened cocoa powder",
            "1/8 teaspoon Salt",
            "3/4 cup Milk ( or whole)",
            "1 tablespoon Butter",
            "1 tablespoon Vegetable oil",
            "1 teaspoon Vanilla extract"
          ],
          "instructions": [
            "Lightly coat an 8x8-inch baking pan with nonstick cooking spray or line with parchment paper.",
            "In a heavy-bottomed saucepan, combine the sugar, cocoa powder, salt, and milk. Stir well to mix.",
            "Place the saucepan over medium-low heat. Stir constantly until the sugar is completely dissolved and the mixture is smooth.",
            "Once the sugar dissolves, stop stirring. Attach a candy thermometer to the side of the pan. Continue cooking without stirring until the mixture reaches the soft-ball stage (234-238°F). This may take 15-20 minutes. Be patient and do not stir during this time, or the fudge may crystallize.",
            "When the mixture reaches the soft-ball stage, remove from heat immediately. Stir in the unsalted butter and oil.",
            "Let the mixture cool, undisturbed, to lukewarm (about 110°F). This may take 30-45 minutes. Do not stir during cooling, or the fudge may become grainy.",
            "Once lukewarm, add the vanilla extract. Beat vigorously with a wooden spoon until the mixture thickens and loses its glossy appearance. This can take 5-10 minutes of beating.",
            "Quickly pour the fudge into the prepared pan and spread evenly with a spatula.",
            "Let the fudge cool completely at room temperature until firm, about 2 hours.",
            "Cut into 1-inch squares. Store in an airtight container at room temperature for up to 2 weeks."
          ]
        }
      ]
    },
    {
      "name": "Cakes",
      "recipes": [
        {
          "name": "Apple Cake",
          "category": "Cakes",
          "servings": "12-16 servings",
          "ingredients": [
            "2 cups All-purpose flour",
            "2 teaspoons Baking soda",
            "1 teaspoon Ground cinnamon",
            "1/4 teaspoon Salt",
            "2 large Eggs",
            "1 cup Granulated sugar",
            "1 cup, packed Light brown sugar",
            "1 cup Vegetable oil",
            "2 teaspoons Vanilla extract",
            "3 cups, peeled and diced Fresh apples (about 3 medium apples)",
            "1 cup Chopped pecans"
          ],
          "instructions": [
            "Preheat oven to 350°F (175°C). Grease and flour a 9x13-inch baking pan.",
            "In a medium bowl, whisk together the flour, baking soda, cinnamon, and salt.",
            "In a large bowl, beat the eggs. Add both sugars, the oil, and vanilla, and mix until well combined.",
            "Stir the dry ingredients into the wet ingredients until just combined. The batter will be very thick and stiff.",
            "Fold in the diced apples and chopped pecans, distributing them evenly.",
            "Spread the thick batter into the prepared pan, smoothing the top as well as you can.",
            "Bake for 30–40 minutes, or until the top is golden brown and a toothpick inserted in the center comes out clean.",
            "Cool in the pan on a wire rack. Serve warm or at room temperature, plain or with a dusting of powdered sugar or a scoop of vanilla ice cream."
          ]
        },
        {
          "name": "Deluxe White Cake",
          "category": "Cakes",
          "servings": "12-14 servings (three 9-inch layers)",
          "ingredients": [
            "2 1/4 cups, sifted Cake flour",
            "1 1/2 cups, divided Granulated sugar",
            "1 1/2 teaspoons Baking powder",
            "1 teaspoon Baking soda",
            "3/4 teaspoon Salt",
            "4 large Egg whites",
            "1/2 teaspoon Cream of tartar",
            "2/3 cup Vegetable oil",
            "1 1/4 cups Buttermilk",
            "1 1/2 teaspoons Vanilla extract"
          ],
          "instructions": [
            "Preheat oven to 350°F (175°C). Grease and flour three 9-inch round cake pans, or line the bottoms with parchment.",
            "In a large bowl, sift together the cake flour, 1 cup of the sugar, the baking powder, baking soda, and salt. Set aside.",
            "In a separate bowl, beat the egg whites until foamy. Add the cream of tartar and continue beating until soft peaks form.",
            "Gradually add the remaining 1/2 cup of sugar to the egg whites, beating until the meringue is stiff and glossy. Set aside.",
            "In another bowl, whisk together the oil, buttermilk, and vanilla until well combined.",
            "Pour the wet ingredients into the dry ingredients all at once and beat with a mixer on medium speed until you have a smooth batter.",
            "Using a rubber spatula, gently fold the meringue into the batter in three additions, making sure to scrape the bottom and sides of the bowl for even mixing.",
            "Divide the batter evenly among the three prepared pans.",
            "Bake for 30–35 minutes, or until the cakes are just firm to the touch and starting to pull away from the sides of the pans. A toothpick inserted in the center should come out clean.",
            "Let the cakes cool in the pans for 5 minutes, then turn out onto a wire rack to cool completely before frosting."
          ]
        },
        {
          "name": "Frosted Carrot Cake",
          "category": "Cakes",
          "servings": "18 servings",
          "ingredients": [
            "1 1/2 cups All-purpose flour",
            "2/3 cup Whole wheat flour",
            "2 teaspoons Baking soda",
            "2 teaspoons Ground cinnamon",
            "1/4 teaspoon Salt",
            "1 cup, packed Light brown sugar",
            "3/4 cup Eggs or large eggs (about 3 large eggs)",
            "3/4 cup Buttermilk ( or )",
            "3 tablespoons Vegetable oil",
            "2 teaspoons Vanilla extract",
            "8 oz can in juice, well drained Crushed pineapple",
            "2 cups, packed Finely grated carrots",
            "1/3 cup Raisins"
          ],
          "instructions": [
            "Preheat oven to 350°F (175°C). Coat a 13x9x2-inch baking pan with nonstick spray.",
            "In a medium bowl, whisk together the all-purpose flour, whole wheat flour, baking soda, cinnamon, and salt.",
            "In a large mixing bowl, combine the brown sugar, eggs or large eggs, buttermilk, oil, and vanilla. Beat at medium speed until smooth.",
            "Add the drained pineapple, grated carrots, and raisins to the wet mixture and stir to combine.",
            "Add the dry ingredients to the wet ingredients and beat just until well blended and no dry pockets remain.",
            "Pour the batter into the prepared pan and spread evenly.",
            "Bake for 30–35 minutes, or until a toothpick inserted in the center comes out clean and the top springs back when lightly touched.",
            "Cool the cake completely in the pan on a wire rack.",
            "Once cooled, spread Orange-Cream Cheese Frosting evenly over the top of the cake.",
            "Cover and refrigerate for at least 1 hour before serving. Cut into squares to serve."
          ]
        },
        {
          "name": "Bakeless Fruit Cake",
          "category": "Cakes",
          "servings": "12-16 slices",
          "ingredients": [
            "1 pound Pecan halves (divided (reserve 40 for top))",
            "1/2 pound, finely crushed Vanilla wafers (about 3 cups crushed)",
            "1/2 pound, finely crushed Graham crackers (about 3 cups crushed)",
            "9 oz Raisins",
            "8 oz, finely chopped Pitted dates",
            "6 oz, drained and chopped Maraschino cherries",
            "1 can (14 oz) Sweetened condensed milk",
            "1/4 cup Bourbon whiskey (or rum)"
          ],
          "instructions": [
            "Reserve 40 whole pecan halves for decorating the top. Coarsely chop the remaining pecans.",
            "In a large mixing bowl, combine the crushed vanilla wafers and crushed graham crackers.",
            "Add the raisins, chopped dates, chopped cherries, and chopped pecans. Mix well to distribute evenly.",
            "Pour in the sweetened condensed milk and bourbon (or rum). Stir thoroughly until the mixture is well combined and holds together.",
            "Line a 9x5x3-inch loaf pan with plastic wrap or waxed paper, leaving enough overhang to cover the top.",
            "Spoon the mixture into the prepared pan and press down very firmly and evenly to compact it.",
            "Arrange the reserved pecan halves decoratively on top, pressing them lightly into the surface.",
            "Fold the excess wrap over the top to cover completely.",
            "Refrigerate overnight, or at least 8 hours, to set.",
            "To serve, unwrap and invert onto a serving platter. Remove the wrap and slice with a sharp knife.",
            "Serve slices plain or with a dollop of whipped cream. Store wrapped in the refrigerator for up to 2 weeks."
          ]
        },
        {
          "name": "Hot Water Gingerbread",
          "category": "Cakes",
          "servings": "12-15 servings",
          "ingredients": [
            "2 1/2 cups All-purpose flour",
            "2 teaspoons Baking soda",
            "1 teaspoon Ground ginger",
            "1 teaspoon Ground cinnamon",
            "1/2 teaspoon Salt",
            "1 cup Molasses",
            "1/2 cup Granulated sugar",
            "1/2 cup, melted Butter",
            "1 large Egg",
            "1 cup Boiling water"
          ],
          "instructions": [
            "Preheat oven to 350°F (175°C). Grease a 9x13-inch baking pan or coat with nonstick spray.",
            "In a large bowl, whisk together the flour, baking soda, ginger, cinnamon, and salt.",
            "In a separate large bowl, combine the molasses, sugar, and melted unsalted butter or butter. Mix well.",
            "Add the egg to the molasses mixture and beat until smooth.",
            "Add the dry ingredients to the wet mixture and stir until just combined.",
            "Carefully stir in the boiling water. The batter will be thin—this is correct.",
            "Pour the batter into the prepared pan.",
            "Bake for 45-50 minutes, or until a toothpick inserted in the center comes out clean and the top springs back when lightly touched.",
            "Cool in the pan on a wire rack for at least 15 minutes.",
            "Serve warm or at room temperature, plain or with whipped cream or lemon sauce."
          ]
        },
        {
          "name": "Spice Cake",
          "category": "Cakes",
          "servings": "8-10 servings",
          "ingredients": [
            "2 cups All-purpose flour",
            "1 cup Granulated sugar",
            "4 tablespoons Cocoa powder",
            "1 teaspoon Baking soda",
            "1 teaspoon Ground cinnamon",
            "1 teaspoon Ground nutmeg",
            "1 teaspoon Ground ginger",
            "1/2 teaspoon Salt",
            "3/8 cup (6 tablespoons) Vegetable oil",
            "1 cup Water",
            "1 cup Raisins"
          ],
          "instructions": [
            "Preheat oven to 350°F (175°C). Grease a 9-inch square or round cake pan or an 8-inch cast iron skillet.",
            "In a large bowl, whisk together the flour, sugar, cocoa powder, baking soda, cinnamon, nutmeg, ginger, and salt.",
            "In a separate bowl or measuring cup, combine the vegetable oil and water.",
            "Pour the liquid mixture into the dry ingredients and stir just until combined.",
            "Fold in the raisins.",
            "Pour the batter into the prepared pan.",
            "Bake for 30-40 minutes, or until a toothpick inserted in the center comes out clean.",
            "Cool in the pan on a wire rack.",
            "Serve plain, as Grandmother did, or dust lightly with powdered sugar if desired.",
            "Note: For a Christmas fruitcake variation, add 1/2 cup chopped nuts and 1/2 cup chopped candied fruit or peel to the batter."
          ],
          "notes": [
            "Grandmother Walters used 1/2 cup of shortening, probably lard. Grandmother baked this cake in a heavy cake pan or an iron skillet. Eggs WERE NOT USED. Cake was not iced."
          ]
        },
        {
          "name": "Old Fashioned Jelly Roll",
          "category": "Cakes",
          "servings": "8-10 slices",
          "ingredients": [
            "3/4 cup, sifted Cake flour or all-purpose flour",
            "3/4 teaspoon Baking powder",
            "1/4 teaspoon Salt",
            "4 large, at room temperature Eggs",
            "3/4 cup Granulated sugar",
            "1 teaspoon Vanilla extract",
            "1/4 cup, for dusting Confectioners' sugar",
            "3/4 to 1 cup Jelly or jam (any flavor)",
            "2 tablespoons (optional) Melted butter (for richer version)"
          ],
          "instructions": [
            "Preheat oven to 400°F (200°C). Grease a 15x10-inch jelly roll pan, line with parchment paper, and grease the paper.",
            "In a small bowl, sift together the flour, baking powder, and salt. Set aside.",
            "Place the eggs in a large heatproof bowl. Set the bowl over a pot of simmering water (double boiler method).",
            "Beat the eggs with an electric mixer while gradually adding the sugar. Continue beating over the hot water until the mixture is very thick, pale, and tripled in volume (about 5-7 minutes).",
            "Remove the bowl from the heat.",
            "Gently fold in the vanilla extract.",
            "Sift the flour mixture over the egg mixture in three additions, folding gently after each addition until just combined. Do not overmix.",
            "If making a richer version, fold in 2 tablespoons melted unsalted butter or butter at this point.",
            "Pour the batter into the prepared pan and spread evenly to the edges.",
            "Bake for 12-13 minutes, until the cake is golden and springs back when lightly touched.",
            "While the cake bakes, lay out a clean kitchen towel and dust it generously with confectioners' sugar.",
            "When the cake is done, immediately run a knife around the edges and invert the cake onto the sugared towel.",
            "Carefully peel off the parchment paper. Trim any crisp edges with a sharp knife.",
            "Starting from a short end, roll the cake up in the towel while it's still warm. Let cool completely on a wire rack, seam-side down.",
            "Once cooled, gently unroll the cake and spread evenly with your favorite jelly or jam.",
            "Re-roll the cake without the towel, and place seam-side down on a serving platter.",
            "Dust with additional confectioners' sugar before slicing and serving."
          ]
        },
        {
          "name": "Holiday Jam Cake",
          "category": "Cakes",
          "servings": "16-20 servings",
          "ingredients": [
            "2 sticks (1 cup), softened Butter",
            "2 cups Granulated sugar",
            "3 large, separated Eggs (or large eggs)",
            "3 cups, sifted All-purpose flour",
            "1 teaspoon Baking soda",
            "1 teaspoon Ground cinnamon",
            "1/2 teaspoon Ground nutmeg",
            "1/2 teaspoon Ground cloves",
            "1/2 teaspoon Ground allspice",
            "1/2 cup buttermilk",
            "1 cup Seedless blackberry jam",
            "1 cup Chopped pecans",
            "1 cup Seedless raisins",
            "1 cup, quartered lengthwise Pitted dates"
          ],
          "instructions": [
            "Preheat oven to 300°F (150°C). Line the bottom of a 10-inch tube pan with parchment or heavy brown paper, then grease and flour the pan and paper well.",
            "In a large bowl, cream together the unsalted butter or butter and sugar until light and fluffy.",
            "If using whole eggs, separate them. Beat the egg yolks (or use large eggs) until thick and pale, then add to the creamed mixture and beat well.",
            "In a small bowl, dissolve the baking soda in the buttermilk. Add this to the creamed mixture and beat until combined.",
            "In a separate bowl, whisk together the flour, cinnamon, nutmeg, cloves, and allspice.",
            "Alternately add the dry ingredients and the blackberry jam to the batter, beginning and ending with the dry ingredients. Mix just until combined after each addition.",
            "If using whole eggs, beat the egg whites in a clean bowl until stiff peaks form. Gently fold the beaten egg whites into the batter by hand.",
            "In a small bowl, toss the pecans, raisins, and dates with 2-3 tablespoons of flour to coat. Fold the floured fruit and nuts into the batter.",
            "Pour the batter into the prepared tube pan and smooth the top.",
            "Bake for 3 to 3 1/2 hours, or until a toothpick or broom straw inserted in the center comes out clean.",
            "Cool in the pan for 15 minutes, then invert onto a wire rack to cool completely.",
            "When completely cool, wrap the cake in a bourbon-, brandy-, or sherry-soaked cloth, or store in an airtight tin with apple slices to keep it moist.",
            "This cake improves with age and will keep in a cool place for up to 6 weeks."
          ]
        },
        {
          "name": "Cocoanut Cake",
          "category": "Cakes",
          "servings": "12 servings",
          "ingredients": [
            "1 recipe Deluxe White Cake (or your favorite white cake, baked in two 9-inch round pans and cooled)",
            "4 cups (1 pound) Confectioners' sugar (sifted)",
            "1/2 cup (1 stick) Butter (softened to room temperature)",
            "1/4 cup Milk (plus more as needed)",
            "1/2 teaspoon Vanilla extract",
            "2 to 2 1/2 cups Sweetened shredded coconut (or unsweetened if preferred)"
          ],
          "instructions": [
            "Bake the Deluxe White Cake (or your favorite white cake recipe) in two greased and floured 9-inch round cake pans according to the recipe directions. Let cool in the pans for 10 minutes, then turn out onto wire racks to cool completely.",
            "While the cakes cool, prepare the buttercream icing: In a large bowl, beat the softened butter or unsalted butter with an electric mixer until creamy.",
            "Gradually add the sifted confectioners' sugar, about 1 cup at a time, beating on low speed after each addition.",
            "Add the milk and vanilla extract. Beat on medium-high speed for 2–3 minutes until the icing is light, fluffy, and spreadable. If the icing is too thick, add a little more milk, 1 teaspoon at a time.",
            "Place one cake layer on a serving plate or cake stand. Spread about 1/2 cup of the icing evenly over the top.",
            "Sprinkle about 1/2 to 3/4 cup of the shredded coconut over the icing on the first layer.",
            "Carefully place the second cake layer on top, pressing gently to adhere.",
            "Frost the top of the cake with a generous layer of icing, then frost the sides, using an offset spatula or butter knife for a smooth finish.",
            "While the icing is still soft, gently press the remaining shredded coconut onto the top and sides of the cake, covering it completely. You may need to work in sections and press the coconut gently with your hands.",
            "Refrigerate the cake for at least 1 hour before serving to let the icing set.",
            "Store leftover cake covered in the refrigerator for up to 4 days. Bring to room temperature before serving for best flavor and texture."
          ]
        },
        {
          "name": "Crumble Cake (Krümelkuchen)",
          "category": "Cakes",
          "servings": "6 cakes (8-inch)",
          "ingredients": [
            "2 cups All-purpose flour (for crust, sifted)",
            "2 teaspoons Baking powder (for crust)",
            "1/4 teaspoon Salt",
            "1/2 cup (1 stick) Butter (for crust, melted)",
            "2/3 cup Granulated sugar (for crust)",
            "2 large Eggs (for crust, or 1/2 cup large eggs)",
            "1/4 cup Milk (for crust)",
            "2 1/2 cups All-purpose flour (for crumble topping)",
            "2 cups Granulated sugar (for crumble topping)",
            "1 teaspoon Vanilla extract (for crumble topping)",
            "2 large Eggs (for crumble topping, or 1/2 cup large eggs)",
            "12 tablespoons (1 1/2 sticks) Butter (for crumble topping, softened)",
            "2 teaspoons Baking powder (for crumble topping)",
            "2 large Eggs (for binder, or 1/2 cup large eggs)",
            "1/4 cup Milk (for binder)",
            "1 teaspoon Vanilla extract (for binder)",
            "1 teaspoon Granulated sugar (for binder)"
          ],
          "instructions": [
            "Preheat oven to 350°F (175°C). Lightly grease six 8-inch pie plates or cake pans.",
            "Prepare the crust: In a large bowl, whisk together 2 cups flour, 2 tsp baking powder, and 1/4 tsp salt. Add the melted unsalted butter, 2/3 cup sugar, 2 eggs (or substitute), and 1/4 cup milk. Mix well until a soft dough forms.",
            "Divide the dough into 6 equal portions. Roll out each portion on a lightly floured surface to fit an 8-inch pie plate, bringing the dough about 3/4 inch up the sides. Press into the prepared pans.",
            "Prepare the crumble topping: In a medium bowl, combine 2 cups sugar, 1 tsp vanilla, 2 eggs (or substitute), 12 tbsp softened unsalted butter, and 2 tsp baking powder. Mix well.",
            "Gradually work in 2 1/2 cups flour, mixing and rubbing with your fingers until crumbles form. The crumbles should be random in size, with the largest about the size of a blueberry.",
            "Prepare the binder: In a small bowl, whisk together 2 eggs (or substitute), 1/4 cup milk, 1 tsp vanilla, and 1 tsp sugar until well combined.",
            "Brush or spoon about 4 teaspoons of the binder mixture evenly over each crust.",
            "Distribute the crumbles evenly over the 6 crusts, dividing them as equally as possible.",
            "Bake for 20-30 minutes, or until the cakes are nicely browned and the crumbles are golden and crisp.",
            "Cool in the pans for 10 minutes, then carefully transfer to a wire rack. Serve warm or at room temperature. These cakes are wonderful with coffee or tea!"
          ]
        }
      ]
    },
    {
      "name": "Pies & Pastry Fillings",
      "recipes": [
        {
          "name": "Apple Pie",
          "category": "Pies & Pastry Fillings",
          "servings": "8 servings",
          "ingredients": [
            "4-5 medium Granny Smith or cooking apples (about 6 cups sliced)",
            "3/4 to 1 cup Granulated sugar (adjust based on apple tartness)",
            "1 rounded tablespoon Cornstarch",
            "2 teaspoons Ground cinnamon",
            "2 tablespoons, melted (optional) Butter",
            "2 (9-inch), unbaked Pie crusts (homemade or store-bought)"
          ],
          "instructions": [
            "Preheat oven to 400°F (200°C).",
            "Peel, core, and dice the apples into bite-sized pieces. You should have about 6 cups of diced apples, generously filling the pie crust.",
            "In a large bowl, combine the diced apples with the sugar, cornstarch, and cinnamon. Toss until the apples are evenly coated.",
            "Place one pie crust into a 9-inch pie pan. Pour the apple mixture into the crust, spreading it evenly. If desired, drizzle the melted unsalted butter over the top of the apples.",
            "Cover with the second pie crust. Trim and crimp the edges to seal. Use a knife to cut several small slits or poke holes in the top crust to allow steam to escape.",
            "Place the pie on a baking sheet to catch any drips. Bake at 400°F for 15 minutes.",
            "Reduce the oven temperature to 350°F (175°C) and continue baking for 45-50 minutes, or until the crust is golden brown and the filling is bubbling.",
            "To test doneness, insert a fork through one of the slits to check if the apples are tender.",
            "Cool on a wire rack for at least 2 hours before slicing. Serve warm or at room temperature, optionally with vanilla ice cream or whipped cream."
          ]
        },
        {
          "name": "Pie Crust",
          "category": "Pies & Pastry Fillings",
          "servings": "Makes 2 single crusts or 1 double crust (8-9 inch)",
          "ingredients": [
            "2 cups, sifted All-purpose flour",
            "1 tablespoon (optional) Granulated sugar (for a slightly sweet crust)",
            "1 teaspoon Salt",
            "1/2 teaspoon Baking soda",
            "1/2 cup Vegetable oil",
            "4-6 tablespoons Cold milk (use as needed for consistency)"
          ],
          "instructions": [
            "In a medium bowl, sift together the flour, sugar (if using), salt, and baking soda.",
            "In a small bowl, whisk together the vegetable oil and 4 tablespoons of cold milk with a rotary beater or hand mixer until the mixture is emulsified and has a milky appearance.",
            "Make a well in the center of the dry ingredients and pour in the oil-milk mixture all at once.",
            "Using a fork, gently stir the mixture, working from the center outward, until it begins to come together. Add 1-2 more tablespoons of milk if the dough seems too dry.",
            "Use your hands to gently gather the dough into a ball. Do not overwork or add extra flour.",
            "Divide the dough in half if making two single crusts.",
            "Place one portion of dough between two sheets of waxed paper or parchment paper. Roll out to about 1/8-inch thickness and to fit your pie pan (9-10 inches in diameter).",
            "Carefully peel off the top sheet of paper, then invert the crust into a lightly greased pie pan. Peel off the remaining paper.",
            "Gently press the crust into the pan and trim the edges. Crimp or flute the edge as desired.",
            "For a pre-baked crust: Prick the bottom and sides with a fork. Bake at 400°F (200°C) for 10-12 minutes, or until lightly golden.",
            "For an unbaked crust: Fill and bake according to your pie recipe directions.",
            "Repeat with the second portion of dough if making a two-crust pie."
          ]
        },
        {
          "name": "Chocolate Cream Pie",
          "category": "Pies & Pastry Fillings",
          "servings": "8 servings (9-inch pie)",
          "ingredients": [
            "1 2/3 cups (for 9-inch) Granulated sugar (reduce to 1 1/4 cups for 8-inch, 5/8 cup for 6-inch)",
            "2/3 teaspoon (for 9-inch) Salt (reduce to 1/2 tsp for 8-inch, 1/3 tsp for 6-inch)",
            "2 2/3 tablespoons (for 9-inch) Cornstarch (reduce to 2 tbsp for 8-inch, 1 1/3 tbsp for 6-inch)",
            "6 tablespoons (for 9-inch) Unsweetened cocoa powder (reduce to 4 tbsp for 8-inch, 2 tbsp for 6-inch)",
            "1 1/3 tablespoons (for 9-inch) All purpose flour (reduce to 1 tbsp for 8-inch, 1/2 tbsp for 6-inch)",
            "2 2/3 cups (for 9-inch) Milk (reduce to 2 cups for 8-inch, 1 1/3 cups for 6-inch; 2% or whole)",
            "3/4 cup (for 9-inch) Large Eggs (reduce to 1/2 cup for 8-inch, 1/4 cup for 6-inch; or use 3 egg yolks for 9-inch)",
            "2 teaspoons (for 9-inch) Butter (reduce to 1 1/2 tsp for 8-inch, 1 tsp for 6-inch)",
            "1 1/3 teaspoons (for 9-inch) Vanilla extract (reduce to 1 tsp for 8-inch, 1/2 tsp for 6-inch)",
            "1 (9-inch, 8-inch, or 6-inch) Baked pie shell (fully baked and cooled)",
            "as desired Meringue or whipped cream topping"
          ],
          "instructions": [
            "Fill the bottom of a double boiler with water and bring to a simmer.",
            "In the top of the double boiler (off the heat), whisk together the sugar, salt, cornstarch, cocoa powder, and flour until well combined and lump-free.",
            "Gradually whisk in the milk until the mixture is smooth.",
            "Place the top of the double boiler over the simmering water. Cook, stirring constantly, until the mixture comes to a boil and thickens, about 8–10 minutes. Let it boil gently for 3 minutes, continuing to stir.",
            "In a small bowl, lightly beat the large eggs (or egg yolks). Slowly whisk about 1/2 cup of the hot chocolate mixture into the egg to temper it, then pour the tempered egg back into the double boiler, whisking constantly.",
            "Cook over the simmering water for an additional 10 minutes, stirring occasionally, until the filling is thick and glossy.",
            "Remove from heat and stir in the unsalted butter or butter until melted and fully incorporated.",
            "Let the filling cool for about 10–15 minutes, stirring occasionally to prevent a skin from forming. When slightly cooled, stir in the vanilla extract.",
            "Pour the chocolate filling into the cooled, baked pie shell. Smooth the top with a spatula.",
            "If topping with meringue: Spread the meringue over the filling while the filling is still warm, sealing the edges to the crust. Bake at 300°F (150°C) for 15–20 minutes until the meringue is lightly golden. Let cool completely before slicing.",
            "If topping with whipped cream: Refrigerate the pie until fully set (at least 3 hours or overnight), then top with whipped cream just before serving.",
            "Store leftovers covered in the refrigerator for up to 3 days."
          ]
        },
        {
          "name": "Vanilla Cream Pie",
          "category": "Pies & Pastry Fillings",
          "servings": "8 servings (9-inch pie)",
          "ingredients": [
            "2/3 cup (for 9-inch) Granulated sugar (reduce to 1/2 cup for 8-inch, 1/3 cup for 6-inch)",
            "2/3 teaspoon (for 9-inch) Salt (reduce to 1/2 tsp for 8-inch, 1/3 tsp for 6-inch)",
            "2 2/3 tablespoons (for 9-inch) Cornstarch (reduce to 2 tbsp for 8-inch, 1 1/3 tbsp for 6-inch)",
            "1 1/3 tablespoons (for 9-inch) All purpose flour (reduce to 1 tbsp for 8-inch, 1/2 tbsp for 6-inch)",
            "2 2/3 cups (for 9-inch) Milk (reduce to 2 cups for 8-inch, 1 1/3 cups for 6-inch; 2% or whole)",
            "3/4 cup (for 9-inch) Large Eggs (reduce to 1/2 cup for 8-inch, 1/4 cup for 6-inch; or use 3 egg yolks for 9-inch)",
            "2 teaspoons (for 9-inch) Butter (reduce to 1 1/2 tsp for 8-inch, 1 tsp for 6-inch)",
            "1 1/3 teaspoons (for 9-inch) Vanilla extract (reduce to 1 tsp for 8-inch, 1/2 tsp for 6-inch)",
            "1 (9-inch, 8-inch, or 6-inch) Baked pie shell (fully baked and cooled)",
            "as desired Meringue or whipped cream topping"
          ],
          "instructions": [
            "Fill the bottom of a double boiler with water and bring to a simmer.",
            "In the top of the double boiler (off the heat), whisk together the sugar, salt, cornstarch, and flour until well combined and lump-free.",
            "Gradually whisk in the milk until the mixture is smooth.",
            "Place the top of the double boiler over the simmering water. Cook, stirring constantly, until the mixture comes to a boil and thickens, about 8–10 minutes. Let it boil gently for 3 minutes, continuing to stir.",
            "In a small bowl, lightly beat the large eggs (or egg yolks). Slowly whisk about 1/2 cup of the hot mixture into the egg to temper it, then pour the tempered egg back into the double boiler, whisking constantly.",
            "Cook over the simmering water for an additional 10 minutes, stirring occasionally, until the filling is thick and smooth.",
            "Remove from heat and stir in the unsalted butter or butter until melted and fully incorporated.",
            "Let the filling cool for about 10–15 minutes, stirring occasionally to prevent a skin from forming. When slightly cooled, stir in the vanilla extract.",
            "Pour the vanilla filling into the cooled, baked pie shell. Smooth the top with a spatula.",
            "If topping with meringue: Spread the meringue over the filling while the filling is still warm, sealing the edges to the crust. Bake at 300°F (150°C) for 15–20 minutes until the meringue is lightly golden. Let cool completely before slicing.",
            "If topping with whipped cream: Refrigerate the pie until fully set (at least 3 hours or overnight), then top with whipped cream just before serving.",
            "Store leftovers covered in the refrigerator for up to 3 days."
          ]
        },
        {
          "name": "Lemon Meringue Pie",
          "category": "Pies & Pastry Fillings",
          "servings": "8 servings (9-inch pie)",
          "ingredients": [
            "1 1/2 cups Granulated sugar (for filling)",
            "6 tablespoons Cornstarch (for filling)",
            "1 1/2 cups Water (boiling)",
            "3/4 cup Egg yolks or large eggs (about 4 egg yolks)",
            "3 tablespoons Butter",
            "1/4 cup Fresh lemon juice (from about 2 lemons)",
            "1 1/2 tablespoons Fresh lemon zest (finely grated)",
            "1 (9-inch) Pre-baked pie crust (cooled completely)",
            "3 large Egg whites (for meringue)",
            "1/4 teaspoon Cream of tartar (for meringue)",
            "6 tablespoons Granulated sugar (for meringue)"
          ],
          "instructions": [
            "Prepare the lemon filling: In a medium saucepan, whisk together the 1 1/2 cups sugar and cornstarch.",
            "Gradually stir in the 1 1/2 cups boiling water. Cook over medium heat, stirring constantly, until the mixture thickens and comes to a boil.",
            "Transfer the mixture to the top of a double boiler set over simmering water. Cook for 10 minutes, stirring occasionally.",
            "In a small bowl, lightly beat the egg yolks or large eggs. Slowly whisk about 1/2 cup of the hot sugar mixture into the eggs to temper them.",
            "Pour the tempered egg mixture back into the double boiler, whisking constantly. Cook for 5 more minutes, stirring constantly, until thick.",
            "Remove from heat. Stir in the unsalted butter, lemon juice, and lemon zest until the unsalted butter is melted and everything is well combined.",
            "Let the filling cool for about 10 minutes, stirring occasionally. Pour into the cooled, pre-baked pie shell. Set aside while you make the meringue.",
            "Preheat oven to 350°F (175°C).",
            "Make the meringue: In a clean, dry bowl, beat the egg whites with an electric mixer until foamy. Add the cream of tartar.",
            "Continue beating on high speed until soft peaks form. Gradually add the 6 tablespoons sugar, one tablespoon at a time, beating constantly until stiff, glossy peaks form. The meringue should stand up straight when the beaters are lifted.",
            "Spread the meringue over the warm (not hot) lemon filling, making sure to seal the meringue all the way to the edge of the crust. This prevents shrinking. Swirl or create peaks for a decorative look.",
            "Bake for 15-20 minutes, or until the meringue is golden brown on the peaks.",
            "Cool the pie at room temperature for 1 hour, then refrigerate for at least 3 hours before serving. The filling needs to set completely.",
            "Serve chilled. Store any leftovers covered in the refrigerator for up to 3 days."
          ]
        }
      ]
    },
    {
      "name": "Cookies & Bars",
      "recipes": [
        {
          "name": "Chocolate Oat-Chip Cookies",
          "category": "Cookies & Bars",
          "servings": "About 4 dozen cookies",
          "ingredients": [
            "1 cup (2 sticks), softened Butter",
            "1 1/4 cups, packed Light brown sugar",
            "1/2 cup Granulated sugar",
            "2 large Eggs",
            "2 tablespoons Milk",
            "2 teaspoons Vanilla extract",
            "1 3/4 cups All-purpose flour",
            "1 teaspoon Baking soda",
            "1/2 teaspoon (optional) Salt",
            "2 1/2 cups, uncooked Old-fashioned or quick oats",
            "2 cups (12 oz package) Semi-sweet chocolate chips",
            "1 cup (optional) Chopped walnuts or pecans"
          ],
          "instructions": [
            "Preheat oven to 375°F (190°C).",
            "In a large bowl, beat the softened unsalted butter with both sugars until light and creamy.",
            "Add the eggs, milk, and vanilla, and beat until well combined.",
            "In a separate bowl, whisk together the flour, baking soda, and salt.",
            "Add the dry ingredients to the wet ingredients and mix until just combined.",
            "Stir in the oats, chocolate chips, and nuts (if using) until evenly distributed.",
            "Drop dough by rounded tablespoonfuls onto ungreased cookie sheets, spacing about 2 inches apart.",
            "Bake for 9-10 minutes for chewy cookies, or 12-13 minutes for crisp cookies. The edges should be lightly golden.",
            "Let cookies cool on the baking sheet for 1 minute, then transfer to a wire rack to cool completely.",
            "Store in an airtight container for up to 1 week."
          ]
        },
        {
          "name": "Ginger Cookies",
          "category": "Cookies & Bars",
          "servings": "About 3 dozen cookies",
          "ingredients": [
            "3/4 cup, softened Butter",
            "1 cup Granulated sugar",
            "1 large, slightly beaten Egg",
            "1/4 cup Molasses",
            "2 cups All-purpose flour",
            "2 teaspoons Baking soda",
            "1/4 teaspoon Salt",
            "1 teaspoon Ground cinnamon",
            "1 teaspoon Ground ginger",
            "about 1/2 cup Granulated sugar for rolling"
          ],
          "instructions": [
            "In a large bowl, cream together the unsalted butter and 1 cup sugar until light and fluffy.",
            "Beat in the egg and molasses until well combined.",
            "In a separate bowl, sift together the flour, baking soda, salt, cinnamon, and ginger.",
            "Gradually add the dry ingredients to the wet ingredients, mixing until just combined.",
            "Cover the dough and refrigerate for at least 1 hour, or until firm enough to handle.",
            "Preheat oven to 350°F (175°C). Line baking sheets with parchment paper or coat with nonstick spray.",
            "Shape the chilled dough into balls about 1 1/2 inches in diameter. Roll each ball in granulated sugar to coat.",
            "Place the balls 3 inches apart on the prepared baking sheets.",
            "Bake for 12-15 minutes, or until the edges are set and the tops are slightly cracked. The centers will still be soft.",
            "Let cookies cool on the baking sheet for 2 minutes, then transfer to a wire rack to cool completely."
          ]
        },
        {
          "name": "Oatmeal Raisin Spice Cookies",
          "category": "Cookies & Bars",
          "servings": "About 4 dozen cookies",
          "ingredients": [
            "1 cup (2 sticks), softened Butter",
            "1 1/4 cups, packed Light brown sugar",
            "1/2 cup Granulated sugar",
            "2 large Eggs",
            "2 tablespoons Milk",
            "2 teaspoons Vanilla extract",
            "1 3/4 cups All-purpose flour",
            "1 teaspoon Ground cinnamon",
            "1/4 teaspoon Ground nutmeg",
            "1 teaspoon Baking soda",
            "1/2 teaspoon (optional) Salt",
            "2 1/2 cups, uncooked Old-fashioned or quick oats",
            "1 cup Raisins",
            "1 cup (optional) Chopped walnuts or pecans"
          ],
          "instructions": [
            "Preheat oven to 375°F (190°C).",
            "In a large bowl, beat the softened unsalted butter with both sugars until light and creamy.",
            "Add the eggs, milk, and vanilla, and beat until well combined.",
            "In a separate bowl, whisk together the flour, cinnamon, nutmeg, baking soda, and salt.",
            "Add the dry ingredients to the wet ingredients and mix until just combined.",
            "Stir in the oats, raisins, and nuts (if using) until evenly distributed.",
            "Drop dough by rounded tablespoonfuls onto ungreased cookie sheets, spacing about 2 inches apart.",
            "Bake for 9-10 minutes for chewy cookies, or 12-13 minutes for crisp cookies. The edges should be lightly golden.",
            "Let cookies cool on the baking sheet for 2 minutes, then transfer to a wire rack to cool completely.",
            "Store in an airtight container for up to 1 week."
          ]
        },
        {
          "name": "Lemon Squares",
          "category": "Cookies & Bars",
          "servings": "16 squares (2-inch)",
          "ingredients": [
            "3/4 cup, sifted All-purpose flour (for crust)",
            "1/3 cup Powdered sugar (for crust)",
            "1/3 cup Ground almonds (for crust)",
            "1/2 cup (1 stick), softened Butter (for crust)",
            "2 large Eggs (for filling)",
            "1 cup Granulated sugar (for filling)",
            "1 teaspoon Grated lemon zest (for filling)",
            "2 tablespoons Fresh lemon juice (for filling)",
            "1/2 teaspoon Baking powder (for filling)",
            "1/4 teaspoon Salt (for filling)",
            "3/4 cup (optional) Sweetened flaked coconut (for filling)",
            "optional Powdered sugar for dusting"
          ],
          "instructions": [
            "Preheat oven to 350°F (175°C). Lightly grease an 8x8x2-inch baking pan or coat with nonstick spray.",
            "For the crust: In a small bowl, blend together the flour, powdered sugar, ground almonds, and softened unsalted butter until the mixture resembles coarse crumbs.",
            "Press the crust mixture evenly onto the bottom of the prepared pan.",
            "Bake for 20 minutes, or until the crust is lightly golden around the edges.",
            "Meanwhile, prepare the filling: In a medium bowl, beat the eggs with a mixer at medium speed until light. Add the sugar, lemon zest, lemon juice, baking powder, and salt. Beat for about 3 minutes until fluffy and well combined.",
            "If using coconut, fold it into the filling mixture.",
            "Pour the filling over the hot baked crust, spreading it evenly.",
            "Return to the oven and bake for an additional 25 minutes, or until the filling is set and the top is golden brown.",
            "Cool completely in the pan on a wire rack.",
            "Once cooled, cut into 2-inch squares. Dust lightly with powdered sugar before serving, if desired.",
            "Store in an airtight container in the refrigerator for up to 1 week."
          ]
        },
        {
          "name": "Memory Book Cookies",
          "category": "Cookies & Bars",
          "servings": "About 8 dozen cookies",
          "ingredients": [
            "1 cup, softened Butter",
            "2 cups, firmly packed Light brown sugar",
            "2 large Eggs",
            "1 teaspoon Vanilla extract",
            "3 1/2 cups All-purpose flour",
            "1 teaspoon Baking soda",
            "1/2 teaspoon Salt",
            "1 cup Chopped pecans or walnuts"
          ],
          "instructions": [
            "In a large bowl, beat the softened unsalted butter at medium speed. Gradually add the brown sugar, beating until light and fluffy.",
            "Add the eggs and vanilla, and mix well.",
            "In a separate bowl, combine the flour, baking soda, and salt.",
            "Gradually add the dry ingredients to the creamed mixture, mixing until well combined.",
            "Stir in the chopped nuts.",
            "Divide the dough in half. Shape each half into a 16-inch long roll (about 2 inches in diameter).",
            "Wrap each roll tightly in waxed paper or plastic wrap, and refrigerate for at least 4 hours or overnight. The dough can also be frozen for up to 3 months.",
            "When ready to bake, preheat oven to 375°F (190°C).",
            "Unwrap the chilled dough and cut into 1/3-inch slices using a sharp knife.",
            "Place the slices on ungreased cookie sheets, spacing them about 1 inch apart.",
            "Bake for 6-8 minutes, or until the edges are lightly golden. Do not overbake.",
            "Cool on the baking sheets for 1 minute, then transfer to wire racks to cool completely.",
            "Store in an airtight container for up to 2 weeks."
          ]
        },
        {
          "name": "Springerle (Preferred Recipe)",
          "category": "Cookies & Bars",
          "servings": "About 4 dozen cookies",
          "ingredients": [
            "4 large Eggs",
            "4 cups, sifted Powdered sugar",
            "4 cups, sifted All-purpose flour",
            "1 teaspoon Baking soda",
            "10 drops (or 1 teaspoon anise extract) Anise oil",
            "from 1 lemon, finely grated Lemon zest",
            "2-3 tablespoons (optional) Crushed anise seeds (for sprinkling on pan)"
          ],
          "instructions": [
            "Sift the flour with the baking soda and set aside.",
            "In a large bowl with an electric mixer, beat the eggs until very light and frothy, about 5 minutes.",
            "Add the powdered sugar a tablespoon at a time, continuing to beat constantly. Beat for at least 15 minutes total, until the mixture is thick and resembles a soft meringue.",
            "Add the anise oil and grated lemon zest, and mix well.",
            "Gradually blend in the sifted flour mixture, mixing until a soft dough forms.",
            "Cover the dough tightly and let it rest for 15-20 minutes.",
            "Lightly flour a work surface. Roll out a small portion of the dough at a time to 1/4-inch thickness.",
            "Press a floured springerle mold (or rolling pin with designs) firmly into the dough to create embossed patterns.",
            "Cut the cookies apart along the design lines.",
            "Place the cookies on ungreased, flat trays or baking sheets. Cover with a clean kitchen towel and let them dry at room temperature overnight (12-24 hours). This drying step is important for the characteristic hard texture.",
            "The next day, preheat oven to 300°F (150°C).",
            "Lightly coat cookie sheets with nonstick spray and sprinkle with crushed anise seeds if desired.",
            "Transfer the dried cookies to the prepared cookie sheets.",
            "Bake for 10-15 minutes. The cookies should remain pale; do not let them brown.",
            "Cool on wire racks. Store in airtight containers. Springerle improve with age and can be stored for several weeks."
          ]
        },
        {
          "name": "Ginger Snaps",
          "category": "Cookies & Bars",
          "servings": "About 4 dozen cookies",
          "ingredients": [
            "6 tablespoons Vegetable oil",
            "1/2 cup Dark molasses",
            "2 cups, sifted All-purpose flour",
            "1/2 cup, firmly packed Brown sugar",
            "2 teaspoons Ground ginger",
            "1/4 teaspoon Ground cinnamon",
            "1/4 teaspoon Ground cloves",
            "1/2 teaspoon Baking soda",
            "1/2 teaspoon Salt"
          ],
          "instructions": [
            "Preheat oven to 350°F (175°C). Line baking sheets with parchment paper or coat lightly with nonstick spray.",
            "In a small bowl, whisk together the vegetable oil and molasses until well combined.",
            "In a large bowl, sift together the flour, brown sugar, ginger, cinnamon, cloves, baking soda, and salt.",
            "Pour the molasses mixture into the dry ingredients and stir until a smooth, cohesive dough forms.",
            "On a lightly floured surface, roll out the dough to 1/8-inch thickness.",
            "Cut into small rounds (about 2 inches in diameter) using a cookie cutter.",
            "Place the cookies on the prepared baking sheets, spacing them about 1 inch apart.",
            "Bake for 15-18 minutes, or until the cookies are crisp and the edges are just beginning to darken.",
            "Cool on the baking sheets for 2 minutes, then transfer to wire racks to cool completely. Store in an airtight container."
          ]
        },
        {
          "name": "Lemon Snaps",
          "category": "Cookies & Bars",
          "servings": "About 3-4 dozen cookies",
          "ingredients": [
            "1/2 cup Light corn syrup",
            "4 tablespoons Vegetable oil",
            "2 tablespoons, finely grated Fresh lemon zest (from about 2 lemons)",
            "2 tablespoons Fresh lemon juice or lemon extract",
            "1 1/2 cups, sifted All-purpose flour",
            "1/2 teaspoon Baking soda",
            "1/2 teaspoon Salt"
          ],
          "instructions": [
            "Preheat oven to 350°F (175°C). Line baking sheets with parchment paper or coat lightly with nonstick spray.",
            "In a medium bowl, whisk together the corn syrup, vegetable oil, lemon zest, and lemon juice or extract until smooth and well combined.",
            "In a separate bowl, sift together the flour, baking soda, and salt.",
            "Pour the wet ingredients into the dry ingredients and stir until a smooth dough forms.",
            "On a lightly floured surface, roll out the dough to 1/8-inch thickness.",
            "Using a small round cookie cutter (about 2 inches), cut out cookies and place them on the prepared baking sheets, spacing them about 1 inch apart.",
            "Bake for 10-12 minutes, or until the cookies are lightly golden and crisp around the edges.",
            "Cool on the baking sheets for 2 minutes, then carefully transfer to wire racks to cool completely. Store in an airtight container."
          ]
        },
        {
          "name": "Brown Sugar Brownies",
          "category": "Cookies & Bars",
          "servings": "16-20 bars",
          "ingredients": [
            "1 cup, packed Brown sugar",
            "1/4 cup, softened Butter",
            "1 large Egg",
            "1 teaspoon Vanilla extract",
            "1 cup All-purpose flour",
            "1 teaspoon (rounded) Baking powder",
            "1/2 teaspoon Salt",
            "1 cup Chopped pecans"
          ],
          "instructions": [
            "Preheat oven to 325°F (165°C). Lightly coat a 9x13-inch baking sheet or jelly roll pan with nonstick spray.",
            "In a medium bowl, cream together the brown sugar and unsalted butter or butter until light and fluffy.",
            "Beat in the egg and vanilla until well combined.",
            "In a small bowl, whisk together the flour, baking powder, and salt.",
            "Add the dry ingredients to the wet mixture and mix until just combined.",
            "Fold in the chopped pecans.",
            "Spread the batter in a thin, even layer on the prepared baking sheet.",
            "Bake for 18-20 minutes, or until the edges are set and lightly golden.",
            "Remove from oven and cut into bars while still warm.",
            "Cool completely on the pan before removing."
          ]
        },
        {
          "name": "Sugar Cookies (Alice Carle's)",
          "category": "Cookies & Bars",
          "servings": "About 3-4 dozen cookies",
          "ingredients": [
            "1 1/2 cups Powdered sugar (sifted)",
            "1 cup (2 sticks) Butter (softened)",
            "1 large Egg (or 1/4 cup large eggs)",
            "1 teaspoon Vanilla extract",
            "1/2 teaspoon Almond extract",
            "2 1/2 cups All-purpose flour",
            "1 teaspoon Cream of tartar",
            "1 teaspoon Salt"
          ],
          "instructions": [
            "In a large bowl, cream together the powdered sugar and softened unsalted butter until light and fluffy.",
            "Beat in the egg, vanilla, and almond extract until well combined.",
            "In a separate bowl, whisk together the flour, cream of tartar, and salt.",
            "Gradually add the dry ingredients to the wet ingredients, mixing until a soft dough forms.",
            "Wrap the dough tightly in plastic wrap and refrigerate for 2-3 hours, or overnight. This makes the dough easier to roll and helps the cookies hold their shape.",
            "When ready to bake, preheat oven to 350°F (175°C). Line baking sheets with parchment paper or coat lightly with nonstick spray.",
            "On a lightly floured surface, roll out the chilled dough to your desired thickness (1/4 inch for crisp cookies, 1/2 inch for softer cookies).",
            "Cut into desired shapes using cookie cutters. Place on prepared baking sheets, spacing about 1 inch apart.",
            "Bake for 10-11 minutes, or until the edges are just barely golden. Do not overbake; the cookies should remain pale.",
            "Cool on the baking sheets for 2 minutes, then transfer to wire racks to cool completely. Decorate with icing or sprinkles if desired."
          ]
        },
        {
          "name": "Sugar Cookies (Preferred)",
          "category": "Cookies & Bars",
          "servings": "About 2-3 dozen cookies",
          "ingredients": [
            "2 1/4 cups All-purpose flour",
            "2 teaspoons Baking powder",
            "1/2 teaspoon Salt",
            "1/2 cup (1 stick) Butter (softened)",
            "1 cup Granulated sugar (plus extra for sprinkling)",
            "2 large Eggs (or 1/2 cup large eggs)",
            "1/2 teaspoon Vanilla extract",
            "1 tablespoon Milk"
          ],
          "instructions": [
            "In a medium bowl, sift together the flour, baking powder, and salt. Set aside.",
            "In a large bowl, cream the unsalted butter and 1 cup sugar together until light and fluffy.",
            "Beat in the eggs and vanilla until well combined.",
            "Gradually add the sifted dry ingredients to the creamed mixture, alternating with the milk, mixing until a dough forms.",
            "If the dough is too soft to roll, wrap it in plastic and refrigerate for 30 minutes to 1 hour.",
            "Preheat oven to 375°F (190°C). Line baking sheets with parchment paper or coat lightly with nonstick spray.",
            "On a lightly floured surface, roll out the dough to your desired thickness (about 1/4 inch for crisp cookies).",
            "Cut into various shapes using cookie cutters and place on prepared baking sheets, spacing about 1 inch apart.",
            "Sprinkle the tops of the cookies lightly with granulated sugar.",
            "Bake for 12 minutes, or until the edges are lightly golden.",
            "Cool on the baking sheets for 2 minutes, then transfer to wire racks to cool completely."
          ]
        },
        {
          "name": "Sugar Cookies (Zuckerkuchen)",
          "category": "Cookies & Bars",
          "servings": "About 5-6 dozen cookies",
          "ingredients": [
            "4 cups All-purpose flour",
            "1 teaspoon Baking soda",
            "1/2 teaspoon Salt",
            "1 1/2 cups Granulated sugar",
            "1 1/2 cups (3 sticks) Butter (softened (traditional used lard))",
            "2 large Eggs (or 1/2 cup large eggs)",
            "1/2 cup buttermilk or sour milk",
            "1 teaspoon Vanilla extract",
            "1 teaspoon Lemon extract"
          ],
          "instructions": [
            "In a large bowl, cream together the sugar and unsalted butter until light and fluffy.",
            "Beat in the eggs and mix well.",
            "In a separate bowl, combine the flour, baking soda, and salt.",
            "In a small bowl or measuring cup, combine the buttermilk, vanilla extract, and lemon extract.",
            "Add the dry ingredients and the flavored milk to the creamed mixture in stages: add about 1/3 of the dry ingredients, mix well, then add about 1/3 of the milk mixture, and mix well. Repeat until all ingredients are incorporated. The dough should be smooth and pliable.",
            "If the dough is too soft, wrap in plastic and refrigerate for 30 minutes to 1 hour.",
            "Preheat oven to 350°F (175°C). Line baking sheets with parchment paper or coat lightly with nonstick spray.",
            "On a lightly floured surface, roll out the dough to 1/4-inch thickness (or thicker if you prefer softer cookies).",
            "Cut into various shapes using cookie cutters. Place on prepared baking sheets, spacing about 1 inch apart.",
            "Bake for 10-11 minutes, or until the edges are just barely golden. Do not overbake.",
            "Cool on the baking sheets for 2 minutes, then transfer to wire racks to cool completely. These cookies are perfect for decorating with icing!"
          ]
        },
        {
          "name": "Liebkuchen (German Spiced Honey Cookies)",
          "category": "Cookies & Bars",
          "servings": "About 6-7 dozen cookies",
          "ingredients": [
            "2 pounds (about 7-8 cups) All-purpose flour",
            "1 pound (2 1/4 cups) Granulated sugar",
            "1 teaspoon Ground cinnamon",
            "1 teaspoon Ground cloves",
            "1 teaspoon Ground allspice",
            "2 teaspoons Hartshorn (baker's ammonia) or baking powder (hartshorn for traditional flavor)",
            "2 pounds (about 2 2/3 cups) Honey",
            "1/2 cup (4 oz) Sherry or red wine",
            "from 1/2 orange Orange zest (finely grated)",
            "from 2 lemons Lemon zest (finely grated)",
            "1 pound (about 4 cups) Pecans or mixed nuts (chopped)",
            "1/4 pound (about 1/2 cup) Citron (finely chopped candied citron)"
          ],
          "instructions": [
            "In a very large bowl, combine the flour, sugar, cinnamon, cloves, allspice, and hartshorn (or baking powder). Mix well and make a well in the center.",
            "Pour the honey, sherry (or wine), orange zest, and lemon zest into the well. Stir to begin combining.",
            "In a food processor or grinder, finely grind the nuts and citron together. Add this mixture to the honey-flour mixture.",
            "Mix by hand, kneading until all ingredients are well blended into a stiff dough. This may take some time and effort.",
            "Cover the dough tightly and let it stand at room temperature overnight. This resting period allows the flavors to meld.",
            "The next day, preheat oven to 325°F (165°C). Line baking sheets with parchment paper or coat lightly with nonstick spray.",
            "On a lightly floured surface, roll out the dough to 1/4-inch thickness. Cut into diamond shapes (traditional) or use cookie cutters.",
            "Place the cookies on prepared baking sheets, spacing about 1 inch apart.",
            "Bake for 12-15 minutes, or until lightly browned. Do not overbake; the cookies should remain soft initially and will firm up as they cool.",
            "Cool on wire racks. If desired, glaze with a simple powdered sugar icing while still slightly warm, or leave plain.",
            "Store in an airtight container. These cookies improve with age and can be stored for several weeks."
          ]
        },
        {
          "name": "Pfeffernusse (Pepper Nuts)",
          "category": "Cookies & Bars",
          "servings": "About 8-10 dozen small cookies",
          "ingredients": [
            "4 large Eggs (or 1 cup large eggs)",
            "1 pound (about 4 cups) Powdered sugar (sifted)",
            "1 tablespoon Butter (melted)",
            "4 cups All-purpose flour",
            "1 teaspoon, level Baking soda",
            "1 teaspoon Ground cinnamon",
            "1 teaspoon Ground cloves",
            "1 to 2 teaspoons Black pepper (use 2 tsp for extra spicy)",
            "2 cups Powdered sugar (for glaze)",
            "3-4 tablespoons Boiling water (for glaze)",
            "1/2 teaspoon Vanilla extract (for glaze)"
          ],
          "instructions": [
            "In a large bowl, beat the eggs slightly. Add 1 pound powdered sugar and the melted unsalted butter.",
            "Mix with an electric mixer for 15 minutes, or beat by hand for 30 minutes. The mixture should be very light and fluffy.",
            "In a separate bowl, combine the flour, baking soda, cinnamon, cloves, and black pepper.",
            "Add the dry ingredients to the egg mixture one tablespoon at a time, mixing well after each addition. This gradual incorporation ensures a smooth dough.",
            "Once all dry ingredients are incorporated, the dough should be stiff but pliable.",
            "On a lightly floured surface, roll out the dough to 1/4-inch thickness.",
            "Cut into small rounds, about 1 1/4 inches in diameter. These are traditional \"pepper nuts\" - small and round.",
            "Preheat oven to 300°F (150°C). Line baking sheets with parchment paper or coat lightly with nonstick spray.",
            "Place the cookies on prepared baking sheets and bake for about 20 minutes, or until slightly browned.",
            "While the cookies are still warm, prepare the glaze: Mix 2 cups powdered sugar with 3-4 tablespoons boiling water and 1/2 teaspoon vanilla until smooth.",
            "Brush or drizzle the glaze over the warm cookies, or dip each cookie into the glaze.",
            "Let the glaze set completely before storing. These cookies keep well and are traditional German Christmas treats."
          ]
        },
        {
          "name": "Gingerbread Men Cookies",
          "category": "Cookies & Bars",
          "servings": "About 3-4 dozen cookies",
          "ingredients": [
            "1 cup, packed Brown sugar",
            "1 cup (2 sticks) Butter (softened)",
            "3 large Eggs (or 3/4 cup large eggs)",
            "1 1/4 cups Molasses (dark or light)",
            "3 cups All-purpose flour (for initial mix)",
            "1 tablespoon Baking soda",
            "1 teaspoon Salt",
            "1 teaspoon Ground cinnamon",
            "1 teaspoon Ground ginger",
            "1 teaspoon Ground allspice",
            "1 teaspoon Ground cloves",
            "5 to 6 cups All-purpose flour (additional, for stiff dough)"
          ],
          "instructions": [
            "Early in the day (or up to 2 days ahead): In a large bowl, combine the brown sugar, softened unsalted butter, eggs, molasses, 3 cups flour, baking soda, salt, and all the spices (cinnamon, ginger, allspice, cloves).",
            "Beat with an electric mixer on low speed until just mixed, then increase to medium speed and beat for 2 more minutes.",
            "Using a wooden spoon, gradually stir in 5 to 6 additional cups of flour until the dough is very stiff and no longer sticky. You may need the full 6 cups.",
            "Divide the dough in half and wrap each half tightly in plastic wrap. Refrigerate for at least 2 hours, or up to 2 days.",
            "When ready to bake, preheat oven to 350°F (175°C). Line baking sheets with parchment paper.",
            "Working with one half of the dough at a time (keep the other half refrigerated), roll out on a lightly floured surface to 1/8-inch thickness.",
            "Cut out gingerbread men shapes using a cookie cutter. Use a spatula to carefully transfer to prepared baking sheets.",
            "Bake for 12 minutes, or until the edges are firm and the cookies are set. Do not overbake.",
            "Cool on the baking sheets for 2 minutes, then transfer to wire racks to cool completely.",
            "Decorate with royal icing, raisins, candies, or leave plain. Store in an airtight container."
          ]
        },
        {
          "name": "Springerle (Carle Recipe)",
          "category": "Cookies & Bars",
          "servings": "About 4-5 dozen cookies",
          "ingredients": [
            "4 large Eggs (or 1 cup large eggs)",
            "1 pound (about 4 cups) Powdered sugar (sifted)",
            "1 pound (about 3 2/3 cups) All-purpose flour (sifted)",
            "2 teaspoons Baking powder",
            "2 tablespoons Butter (melted and cooled)",
            "from 1 lemon Fresh lemon zest (finely grated)",
            "10 drops Anise oil (or 1 tsp anise extract)"
          ],
          "instructions": [
            "In a large bowl with an electric mixer, beat the eggs and powdered sugar together for at least 15 minutes. The mixture should be very thick, pale, and fluffy, resembling a soft meringue.",
            "Add the cooled melted unsalted butter, anise oil, and grated lemon zest. Mix well until fully incorporated.",
            "Sift together the flour and baking powder. Add to the egg mixture and mix well until a smooth, firm dough forms.",
            "Cover the dough and let it rest for 15-20 minutes to make it easier to roll.",
            "On a lightly floured surface, roll out the dough to 3/8-inch thickness (slightly thicker than most cookies).",
            "Press a floured springerle rolling pin or mold firmly into the dough to create the traditional embossed designs.",
            "Cut the cookies apart along the design lines using a sharp knife or pastry wheel.",
            "Place the cookies on lightly greased baking sheets or parchment paper. Leave space between them.",
            "Cover with a clean kitchen towel and let the cookies stand at room temperature overnight (12-24 hours). This drying step creates the characteristic hard texture.",
            "The next day, preheat oven to 325°F (165°C).",
            "Bake for 15-20 minutes, or until the cookies are slightly browned on the bottom but still pale on top. Do not overbake.",
            "Cool completely on wire racks. Do not ice these cookies; the anise flavor and embossed design are meant to shine on their own.",
            "Store in airtight containers. Springerle improve with age and can be kept for several weeks. They will soften slightly over time."
          ]
        },
        {
          "name": "Springerle (Carle Recipe)",
          "category": "Cookies & Bars",
          "servings": "About 4 dozen cookies",
          "ingredients": [
            "4 Large eggs (at room temperature)",
            "1 pound (about 3 3/4 cups) Powdered sugar (sifted)",
            "4 cups All-purpose flour (sifted)",
            "1 teaspoon Baking powder",
            "1/2 teaspoon Anise oil (or 1 tablespoon anise extract)",
            "from 1 lemon Fresh lemon zest (finely grated)",
            "2-3 tablespoons Anise seeds (crushed, for sprinkling)"
          ],
          "instructions": [
            "In a large bowl, beat the eggs with an electric mixer on high speed for about 15 minutes until very light, thick, and pale yellow.",
            "Gradually add the powdered sugar, a few tablespoons at a time, beating constantly. Continue beating for at least 10 more minutes until the mixture is thick and resembles a soft meringue.",
            "Sift the flour with the baking powder.",
            "Add the anise oil and grated lemon zest to the egg mixture and beat until incorporated.",
            "Gently fold in the flour mixture with a spatula until just combined. Do not overmix.",
            "Cover the dough and refrigerate for at least 1 hour or overnight.",
            "On a lightly floured surface, roll out a portion of the chilled dough to 1/4-inch thickness.",
            "Press a floured springerle mold or rolling pin firmly into the dough to emboss the traditional designs.",
            "Cut the cookies apart along the embossed lines using a sharp knife or pastry cutter.",
            "Place cookies on ungreased baking sheets. Cover with a clean kitchen towel and let dry at room temperature overnight (12-24 hours). This step is essential for the characteristic hard texture.",
            "The next day, preheat oven to 300°F (150°C).",
            "Lightly grease cookie sheets and sprinkle with crushed anise seeds.",
            "Transfer the dried cookies to the prepared sheets.",
            "Bake for 12-15 minutes. The cookies should remain very pale; do not let them brown.",
            "Cool on wire racks. Store in airtight containers. Springerle improve with age and can be stored for several weeks or even months.",
            "Note: This is Caroline Nagel Carle's original recipe, a treasured family tradition."
          ]
        },
        {
          "name": "Sugar Cookies (Alice Carle's)",
          "category": "Cookies & Bars",
          "servings": "4-5 dozen cookies",
          "ingredients": [
            "1 cup (2 sticks) Butter (softened)",
            "1 1/2 cups Granulated sugar",
            "2 Large eggs",
            "1 teaspoon Vanilla extract",
            "3 cups All-purpose flour",
            "3 teaspoons Baking powder",
            "1/2 teaspoon Salt"
          ],
          "instructions": [
            "In a large bowl, cream together the softened unsalted butter and sugar until light and fluffy.",
            "Beat in the eggs one at a time, then add the vanilla extract and mix well.",
            "In a separate bowl, sift together the flour, baking powder, and salt.",
            "Gradually add the dry ingredients to the creamed mixture, mixing until well combined.",
            "Cover the dough and refrigerate for at least 2 hours or overnight.",
            "Preheat oven to 375°F (190°C). Line baking sheets with parchment paper.",
            "On a lightly floured surface, roll out the chilled dough to 1/8-inch thickness.",
            "Cut out shapes with cookie cutters and place on prepared baking sheets about 1 inch apart.",
            "Bake for 8-10 minutes, or until the edges are just beginning to turn golden.",
            "Cool on baking sheets for 2 minutes, then transfer to wire racks to cool completely.",
            "Decorate with frosting, sprinkles, or colored sugar if desired.",
            "Note: This recipe was used by Alma Carle in the 1950s when the children were small."
          ]
        },
        {
          "name": "Frosted Pineapple Squares",
          "category": "Cookies & Bars",
          "servings": "About 24 squares",
          "ingredients": [
            "1/2 cup Sugar",
            "1/4 teaspoon Salt",
            "3 tablespoons Cornstarch",
            "1 can (1 lb 14 oz) Pineapple chunks with juice",
            "1/2 cup Milk",
            "3 3/4 to 4 1/4 cups All-purpose flour (unsifted)",
            "1 teaspoon Sugar (for activating yeast)",
            "1 package (about 2 1/4 teaspoons) Active dry yeast",
            "1/2 cup Water (warm, 105–115°F / 40–46°C)",
            "1 cup Butter (softened)",
            "4 Egg yolks (room temperature (plus 1 extra yolk used in filling))",
            "As needed Confectioners' sugar frosting (for drizzling over cooled squares)"
          ],
          "instructions": [
            "Make the pineapple filling: In a medium saucepan, whisk together sugar, cornstarch, and salt. Stir in the pineapple (with its juice) and the milk.",
            "Cook over medium heat, stirring constantly, until the mixture comes to a full boil and thickens to a spoon-coating consistency. Remove from heat and let cool to room temperature.",
            "Make the dough sponge: In a large bowl, combine about 1 1/3 cups (160 g) of the flour, the 1 teaspoon sugar, and the dry yeast.",
            "Warm the water and unsalted butter together until just warm to the touch (105–115°F / 40–46°C). Add to the flour-yeast mixture and beat on medium speed for 2–3 minutes, scraping the bowl occasionally.",
            "Beat in the egg yolks and another 1/2 cup (60 g) of flour. Continue adding just enough of the remaining flour to form a soft, slightly sticky dough.",
            "Turn the dough out onto a lightly floured surface and knead 8–10 minutes, adding flour only as needed, until smooth and elastic.",
            "Place the dough in a lightly greased bowl, turn to coat, cover, and let rise in a warm, draft-free place until doubled, about 1 hour.",
            "Lightly grease a jelly-roll pan (about 10x15 in / 25x38 cm). Divide the dough in half. Roll one half to fit the bottom of the pan and transfer it to the pan.",
            "Spread the cooled pineapple filling evenly over the dough in the pan.",
            "Roll the remaining dough to the same size and place over the filling. Pinch edges to seal and snip the top in several places with scissors to allow steam to escape.",
            "Cover and let rise again until puffy, 30–45 minutes.",
            "Near the end of rising, preheat the oven to 350–375°F (175–190°C).",
            "Bake 25–35 minutes, or until the top is deep golden brown and the bread sounds hollow when tapped.",
            "Cool completely in the pan. Drizzle with confectioners' sugar frosting and cut into squares to serve."
          ]
        }
      ]
    },
    {
      "name": "Jams, Jellies & Pickles",
      "recipes": [
        {
          "name": "Cranberry Orange Relish",
          "category": "Jams & Jellies",
          "servings": "About 2 1/2 cups",
          "ingredients": [
            "12-16 ounces (1 package) Fresh or frozen cranberries (about 3-4 cups)",
            "1 whole Medium orange (unpeeled)",
            "3/4 to 1 cup Granulated sugar (to taste)"
          ],
          "instructions": [
            "Rinse the cranberries and pick over to remove any stems or soft berries.",
            "Scrub the orange well. Cut it into 8 wedges and remove any seeds, but leave the peel on.",
            "If using a food processor: Pulse the cranberries and orange wedges together until finely chopped but not pureed. If using a meat grinder: Grind the cranberries and orange wedges through the grinder.",
            "Transfer the mixture to a bowl and stir in sugar to taste, starting with 3/4 cup and adding more if you prefer it sweeter.",
            "Cover and refrigerate for at least 2-3 days before serving to allow the flavors to meld.",
            "Serve as a condiment with turkey, chicken, or ham. Keeps refrigerated for up to 2 weeks."
          ]
        },
        {
          "name": "Ice Box Pickles",
          "category": "Pickles",
          "servings": "About 4 pounds pickles",
          "ingredients": [
            "3 1/2 to 4 pounds Fresh cucumbers (scrubbed well)",
            "1/4 cup Pickling salt (for brine)",
            "6 cups Water (for brine)",
            "1 tablespoon Alum",
            "4 cups White vinegar (5%) (approximately)",
            "3 cups Granulated sugar",
            "2-3 tablespoons Pickling spices"
          ],
          "instructions": [
            "Scrub the cucumbers well and cut into 1/2-inch chunks, or leave whole if small.",
            "Dissolve 1/4 cup pickling salt in 6 cups water. Pour over cucumbers in a large bowl or crock. Place a plate on top and weigh it down to keep cucumbers submerged. Let sit at room temperature for 4 days.",
            "Drain and rinse the cucumbers well.",
            "Dissolve 1 tablespoon alum in enough water to cover the cucumbers. Cover and refrigerate overnight.",
            "Drain and rinse again. Place cucumbers in a clean container and cover with about 4 cups white vinegar. Let soak for 6 hours.",
            "Drain the vinegar (you can save it for another use).",
            "In a large crock or container, layer the cucumber chunks with the sugar and pickling spices. Stir and turn occasionally until all the sugar dissolves.",
            "Cover and refrigerate. The pickles will be ready to eat in 2-3 days and will keep refrigerated for several weeks."
          ]
        },
        {
          "name": "Kool-Aid Jelly",
          "category": "Jams & Jellies",
          "servings": "About 3 half-pint jars",
          "ingredients": [
            "3 cups Water",
            "1 packet (0.13-0.16 oz) Unsweetened Kool-Aid drink mix (any flavor)",
            "1 package (1.75 oz) Sure-Jell fruit pectin",
            "3 cups Granulated sugar"
          ],
          "instructions": [
            "Sterilize 3 half-pint jelly jars and lids by boiling them in water for 10 minutes. Keep hot until ready to use.",
            "Pour 3 cups of water into a large saucepan. Stir in the Kool-Aid powder and Sure-Jell until completely dissolved.",
            "Bring the mixture to a rolling boil over high heat, stirring constantly.",
            "Add all 3 cups of sugar at once. Stir constantly and bring back to a full rolling boil.",
            "Boil hard for 1 minute, stirring constantly.",
            "Remove from heat and skim off any foam from the surface.",
            "Quickly ladle the hot jelly into the hot sterilized jars, leaving 1/4-inch headspace.",
            "Wipe the rims clean, seal with lids and rings, and let cool. The jelly will set as it cools.",
            "Store in the refrigerator for up to 3 weeks, or process in a boiling water bath for 5 minutes for shelf-stable storage."
          ]
        }
      ]
    }
  ]
}